{
    "2024-07-25": [
        "I'm with the furlongs it seems. They have a bit of a bakery in their house, or on their property. I have made or bought some vegan desserts. We are about to go somewhere so I quickly try to find places in the fridges for the deserts. The fridges are pretty full so it is tough and people are waiting so I rush. We leave and when we get back we decide to smoke. Someone packs the bowl and gives me the first hit. I accidentally take a hit that burns most of the green. A bit later Audrey asks if I want to do some acid. I say yes and atia shows up and she wants to as well. I'm reluctant, but Audrey seems to think it's fine. Audrey put a bunch of very different sizes or blotter paper squares in my hand. I go over to Atia and while I'm trying to find a good small one, atia like a huge one with like 40 hits and sticks in her mouth. I immediately take it out, bit now it's all wet. I ask Audrey what to do. Audrey says to just let atia eat it all. 40 is way too much though, i decide to give her about 10 back and i eat about 10 myself. I decide I'll just stay with her. Vayla shows up in a bit and the 3 of us hang out together. Nick shows up and he takes a hit. Atia and a i start to trip. A group of us start to play hide and seek. Nick says that kaius has set off some sort of alarm to call cps or something and so officials are on the way. I'm concerned that they will come across the girls. Nick says that one of the servants little kids killed a baby tonight so the officials had already been over."
    ],
    "2024-07-10": [
        "I'm with nick and dad on vacation on a beach. It is sunny and nice. Nick leaves, next day it is snowy. I try to take a bunch of videos,  but i'm unable to get a good picture that really shows how snowy it is. There are always people in the frame covering up the snow. It was really snowing hard at first on the beach, but as i am trying to get video of it the snow starts to slow down.",
        "I'm on a submarine with a bunch of people. Sabrina carpenter is there and we are kinda friends. She made a vegan cake that wasn't great. She comes and asks me to make food with her.  I go, she says she wants to make a cake and has 3 choices, asks what I want. I say I probably can't eat them and she says she has a vegan one.",
        "I was in a city in daytime. I leave and return and get dropped off in the outskirts at night. I need to get to the center. I decide to run. As I'm running I start jumping and I am kinda floating. I think its like a dream, but this is a little worrying because If I am dreaming then I don't know where I really am right now and I decide it's ridiculous that I may be dreaming, and not realistic I have a pillow with me. I run by some homeless people, some try to stop me and atone people I'm running down a hill and someone tries to get me. I almost wipe out. When I get low they through a can at me."
    ],
    "2024-07-09": [
        "I'm in Korean prison camp. Not my first time. I know they will shave me and I don't want to be shaved. I'm handcuffed, by a strange guard. I escape the prison, bit I'm in Korea and it's dangerous. I need to get to Australia. I see nick one day. We talk about ai art. He has an idea about making it better. We plan to meet the next day for meetings. I see him before meeting, some homeless foreigner trìes to sell me weed. I accept 9 dollars.  I have so much stuff, need to reorganize everything. Guy leaves before I pay, I need to catch up."
    ],
    "2024-07-08": [
        "I was travelling in a town that reminded me of a little Scottish town i went to in real life. I had some laundry i had to do and someone tells me about a store where i can do it. I get there and there are some options. there is a free option that just gives you a little soap and tells you where to find water. I choose this option and go to the place with the water. it is like a backyard with a couple covered picnic tables. While I am getting ready a couple people come, a girl and someone else. it is somehow known that we are going to be watching a movie together on my computer in this back area. The back area sort of transforms into the back room of a coffee shop. The girl starts looking like she is getting ready to set up in the hallway. I tell her we are going to watch the movie in the back area because there is seating here. I tell her kind of snippily and mean and so she snaps back that she is doing something with her hard drive. I feel a little dumb, but now i'm upset with her."
    ],
    "2024-07-06": [
        "I Enroll college and I am in class. I smoke some meth in class I believe. I think the meth helps me study. I am taking notes in class and I am drinking water. The class starts passing around another bottle of water for everyone to share. I drink some of that one and I keep it on my desk without passing it on. I now have two bottles of water. Some students come into the class from outside and they are wet, it must be raining outside."
    ],
    "2024-07-05": [
        "I'm in special house with a few strangers, we just got here. I have some money on a couple different currencies. It almost feels like a halfway house or something, like it is friendly, but other people are in charge, It's like we are patients. I have a computer like machine and i'm doing something with my money. I leave it and when i come back i think some is gone, bit I'm not sure. I blame this big guy, but I can't be sure. I find out some people are leaving to go up north, and if I ride in the back of their huge truck then I can go with them. I get the truck and we start driving. I'm sitting in the back of a big open moving truck. It is empty and I have to hold on and it's a little sketchy. We get to a police checkpoint. The police ask where we are coming from and going to, the big guy says we are coming from Connecticut. I'm surprised i thought we were coming from far south, and I'm nervous because I'm riding with a seat or belt or anything. A lady boards the vehicle and tells the four of us that we will need to spell a number in the building here. She has us all show that we can, 3 of us can do it fine, but the big guy clearly can't spell, he tries to spell six with \"th\" or something. we wait for a bit and the lady says it is almost my turn. I go to find the place,  but end up in a bathroom. I leave the bathroom, which is a little tricky because the doors just look like walls. The building is very makeshift and is all walls, no ceilings. Someone helps me find the room when I'm supposed to spell. The lady had said that we are supposed to give a math question and the spell the answer. My question I chose was 52/2 and I spell twenty six. I do it easily to the man, but he says it felt too easy, and I have to do something more challenging. I decide to do 102×12, but he says it has to be something I have been practicing. I'm getting annoyed and I'm distracted. It's hard to describe, but the man either is himself, or is on a box of caterpillars. The caterpillars are all different sizes, the caterpillars are climbing all over each other, some are huge and tiny. I have the feeling that the huge ones one mothers and the babies eat their slimy poop, and sometimes the mothers eat the babies. I remember thinking that the caterpillars were a metaphor for the people who stopped us and us, they are the mothers and they are doing their thing and maybe we will get eaten and we are powerless. I am annoyed about the math question thing, I know I can do it, and I don't know what the point is.  I say I will leave and prepare. I'm walking back to the truck and I see the road ahead, it seems unblocked, I think we maybe could just drive away. I'm sure the big guy won't pass the spelling test, so i think he will be willing to drive away. I wake up as I'm getting back to the truck."
    ],
    "2024-07-04": [
        "Hatice and I are at the driftwood house. Mom and Dad are there too. We are going to be borrowing their rv. Hatice and I checkout the rv. We are trying to figure out how to turn on the generator and stuff. Mom and dad come while hatice and i are sitting in the front seat of the rv. We are going to take the rv somewhere, but hatice is tired so she goes in the house. Dad is in the passenger seat and I am driving the rv.",
        "Hatice and I go on vacation to somewhere tropical and slightly poor. We are planning on renting a vehicle to live in instead of a hotel. The vehicle is like a small rv. It is full of food. The owner of the rental small rv says we can eat as much as we want. They say this type of rental is getting more popular and soon there will be more of these near the airport."
    ],
    "2024-07-03": [
        "I am at a professional soccer match and something happens to the goalie so they put me in. I am not really a player. I am trying my best, and I block. Few goals, but it doesn't take long for me to get scored on. A ball is kicked from so far away, and it looks like it is going far right so I head over there and the ball goes straight in. I keep playing, but I think it is 5 to 2 and we have almost no chance. Later a smaller group of us is playing in a hallway. It is much more casual and the players are giving me advice as we play. There is someone in a wheelchair in our hallway soccer court that isn't playing, just sitting there blocking space. Someone tells me that since kicking high or low isn't working for me and so there is an obvious other option, kicking in the middle range."
    ],
    "2024-07-02": [
        "I'm with someone, maybe savage, maybe someone else. We are in Austin and we are going to the theater where kill tony is. We get there and there is a line of people that goes around the corner of the block. We ask the last person in line if they know how likely it is that we will actually be able to get in to see the show. They say they don't know. We decide to wait and we do eventually get in and we get seated. There is almost nobody in the theater, maybe 10 people in the front row, and then a few of us scattered around in the back, most seats are empty. I am a bit confused, I assume there must be more people on the way to see the show. I recognize some people from Kill Tony, but Tony isn't actually there. The stage is way bigger than the show on youtube as well. it is like the front part of the stage is just a small fraction of the whole stage. The show goes on for quite a while, it is like improv, but not very funny. The person I am with leaves because they don't like the show. I realize after a while that today is Tuesday, not Monday and this show must not be kill tony. I leave the theater room and go talk to a worker about what I can do to get tickets for the next actual kill tony show."
    ],
    "2024-07-01": [
        "I am in a foreign city. It is a city where there is a tesla robot factory. I talk to nick on the phone and I decide to go check out the factory. I find out where it is and I go. After I get in the building, I am in a small, fairly crowded first floor. I find out the tesla robot factory is a few floors up. As I am making my way to the stairs/elevator, a cute girl grabs my crotch. I feel guilty because in dating hatice. I make my way up the stairs and get to the tesla robot factory. There are some people working at desks and quite a few robots around. I wonder if I'm allowed to take pics or videos. I don't want to ask and be told no, so I just try to take some sneakily."
    ],
    "2024-06-30": [
        "I'm on the moon with someone else. It is very snow. We have a base on the moon. We go out exploring.we decide that I will come back and the other person will keep exploring. They plan to refollow their trail to get back to me. While they are out I explore some more nearby. I find a large, blue cricket, it is alive and realistic, but somehow has a body mad of this sticks. I take lots of video of it. In the video it's face looks like claymation. My partner doesn't come back after a long time. There is a storm and it gets rid of their tracks. I keep following the large blue stick figure cricket around the moon. Eventually we get to a small cave hole thing and it goes in. I think my partner eventually comes back but I'm not sure.",
        "I am outside near water with a group of people standing around who are watching me and another guy. The guy has a black grenade. He hands it to me and tells me to throw it. I ask where and he says anywhere, but not in the water. I think it's a bad idea with so many people around, but he insists. I tell him to throw it and so he does. He throws it into the water nearby and it makes a medium sized splash. Somehow a little bit later one of the Southpark boys are minding their own business and a group of 3 people show up to beat them up and they very easily defined themself and kick their asses."
    ],
    "2024-06-29": [
        "I get a large two story Rental. At first I'm alone. There are so many beds to choose from. A Retarded guy and grace show up and someone else. I get the retarded guy and grace set up in my room. I will share a bed with the guy, and grace will take the other bed. There are some other people there. There is a large box with a massive folding puzzle in it. I do some prank by getting in the box or something. The prank doesn't really work. I already slept here one night so I have used some of the nicer pillows. I'm trying to work out who will get which pillows. At some point I explore the house and reminded that there are other beds in other rooms with blankets and pillows. I decide I will sleep in a different bed. The bed is very ornamental, and colorful, like a castle bed. There are only heavy blankets, no sheets, and I see this as a problem.",
        "There is a tornado doing lots of damage. It is on the news. Someone starts to tell me it was made by some people. There are a group of dudes out on a boat. One of them puts there hand in the water from off the side of the boat. They start spinning it in a circle and it gets a whirlpool started. They keep boating next to it and gradually it gets bigger and bigger and faster and faster. Before it is too big, the original guy decides to get in it. He doesn't sink right away, and once in it he starts to spin around faster and faster. He gets out and the other guys start taking turns trying to quickly walk on it without going into the water."
    ],
    "2024-06-27": [
        "I'm at a pizza place with mom, dad, nick, maybe more people. It is a game that felt like it made sense in the dream, but now it doesn't. We took turns and had to pretend like we were making a pizza, or maybe we were making it and the rest of the family had to try to guess what we were doing. We left at one point because some of us didn't like the game, but we came back.",
        "I get an airbnb on a campus. I go to my room to check it out. For some reason, I don't leave my stuff there. I have a wheeled suitcase and a backpack. I take both the suitcase and the backpack to go explore the university. I get to an area with a security booth at the top of a driveway. I walk through it and the guards stop me and ask what I'm doing. I explain and they say I can't go through. While talking to them I realize this area is an elementary school. I ask where to go explore, they tell me and so I go. I need to get through a parking garage. While there I get to a ramp I can't get up.i decide to put everything into my backpack. While I'm doing that, a mom and son come to get into a car right next to me. The mom is pissed, she is chastising the boy for being bad. A very fitting sing starts playing. I think it would be cool if that was on purpose, like constant sentiment analysis and custom songs. I get everything in my suitcase and find a less steep ramp, I have to backup because a lady is coming down the narrow ramp and it is narrow."
    ],
    "2024-06-25": [
        "I don't remember the specifics, but I'm in some dystopia world where I had some appointment and I was late a little bit to something and so my life fell apart. I basically ended up in a jail of some sort. I would try to get my way out of by charming government workers, but nothing ever worked, everything was so strict.",
        "I'm playing a board game with Nick, kaius, and a girl, maybe one of nicks girls. It seems fairly simple. We can all build houses or hotels on our own boards. The more buildings we have, the more money we get. We can use money to destroy each other's buildings. I didn't fully understand the rules at first, so i was surprised when nick destroyed my buildings. Nick and the girl leave for a little bit and kaius takes his turn. Nick comes back and asks if it is his turn .I say kaius just went, this means it is the girls turn. Nick starts to go and I stop him because it's the girls turn."
    ],
    "2024-06-24": [
        "Hatice and I are travelling together. We have a little argument and I got on a train or bus ahead of her. I know she will catch up in a couple stops. She doesn't catch up though. She doesn't message either. I message her buy she doesn't respond. I start to worry because I have no way to contact her. I realize that we have no plan to deal with such a situation and I panic some.",
        "It is hatice's birthday. We are on a hill, snowy mountains. I see a massive tumbleweed in the distance and I point it out to hatice. As we look closer we see that it is actually a clump of trees. Hatice and I start hiking up the mountain. I say it would be really dangerous to try and ride on one of the clumps of tumbleweed trees and use it to ski down a mountain. We get on one though and we use it to ski on, it's a rush, but really dangerous.",
        "I find out I'm going to be a goalie for a professional football team. I am a surprisingly large guy. I feel patriotic about this team. It is strange because I ask a player if my body type is the usual type for people for the goalie of this team. They say yes, of course, it is always the same goalie. It's just different because I'm the one in the body, because the guy who is usually in the body isn't here. The other team has the ball down near us at the start of the game. I block a goal and think I'll have a powerful drop kick, but I don't get it to go far. It doesn't take long for the other team to score. There is a foul though and so the ref gives them a penalty kick for an extra point. The ref leaves the player from our team in front of the goal that did the foul. The other teams scores again."
    ],
    "2024-06-23": [
        "I on vacation in a city with a group of people. We have a hotel room, I think it is room 846. We get there and that Asian guy from that podcast is one of the people in the room. He sells me something that is very expensive, it's like 65k or something, and I give him 80k and he gives me back like $250. I say this is the wrong amount of change, but he insists it is right. I think it's kind of funny, but I insist he gives me the right amount. More people are there and so I try to get other people on my side. We keep hanging out and that Asian podcast guy is doing something with razor blades in his chair and I notice the chair is covered in blood. Nobody had noticed, not even the Asian guy, but somehow he sliced his back badly and was bleeding a lot. I say I will run to an emergency room to get help. The hotel is in a mall and I had seen an emergency room in the mall. Someone goes with me, and we look all over, but we can't find the emergency room. We decide to go back to the hotel, but we get lost going back there. We end up in a movie theater, and we ask the workers for directions, and they say they don't know. We end up finding the hotel, but when we get there, nobody is there. We decide to go have dinner. There is a restaurant that we ate at before, so we decide to look for something new. While eating we overhear the bartender say there was just someone here doing magic tricks for gluten-free breadsticks. I think it must be savage, so I ask the bar tender if they were dressed like a pirate, and they say no. Later on I am in a living room with a few people and nick is there. He needs to go back to the hotel, but doesn't remember the number of the room. I say I think it's 946 or something, but I'm not sure. I tell him I think i can find it in my computer. I have a spreadsheet with a bunch of stuff in it. I say it is my search history. There is a list of numbers and the first number is 846, so I tell him I am fairly confident that 846 is the room number."
    ],
    "2024-06-22": [
        "I'm in an underwater vehicle with savage. At first I think we are at the titanic, but there are arm holes for us to stick limbs out of the submarine. We leave the little sub at some point. We don't have scuba gear or tanks, but breathing is not an issue. We see our little submarine from a distance and can see a square window that we were looking out of. Inside the submarine it is bright. We get to a huge chamber and we both jump down it. We can kind of swim up, but there is a bit of gravity."
    ],
    "2024-06-21": [
        "I have a big van in nyc. I am somehow associated with the police, and some police are being let go. I am driving fast on a bridge and I don't starve enough on a curve and I go off the side.",
        "I'm with Audrey and we are freebasing coke. She is showing be a very psychedelic animated videogame. It is like we can just skip through the levels to see various animations. I ask her at some point if the game is playable and she isn't sure. We are at someone else's home and they ask if we want a table to do lines and I say yes."
    ],
    "2024-06-20": [
        "I go to an open mic kind of place, hatice isn't there. She wants to know what's going on though, so at first I'm telling her. There are presentations on people who use their kids to play tricks on places like fast food restaurants and stores. I end up secretly holding up my phone so she can watch what's happening. After that ends, or I leave, I go to explore the area some. It is kind of like hatice is here now, and kind of like I'm alone. There are movies and hatice and I are deciding what to watch. We start watching an old Southpark that we have seen before, and I mention there is a new one that we've not seen. We don't watch the new one. I'm alone again, wandering around. There are lots of kinds here, it is like most of the kids are just playing and exploring. It is a large campus with  big majestic buildings and many green open spaces. There are some young Asian kids that are going to school here. The free kids have been told there is a building with a door that they are not allowed to enter. I hear about it, and go to it, and there is a group of kids standing at it. I offer to make a video of what is behind it and sell it to the kids. I'm half joking. I open it and we all realize it is just a door to outside and so all the kids flood through. I make jokes about how realistic it is. We see a group of Asian children going to and from class.",
        "Fake money at mcdonalds. I'm with some people who are at mcdonalds and we have fake money. I think it is theirs. They get me to spend it so we can get real money as change. After we leave they want the change, but i want to keep it because i took the risk. Later on i am worried because there were cameras, and i am in a foreign country. I decide i need to sneak out of the country. It is hard though because i am a deer. I decide to try to use the metro to do it. Some workers see me struggling and they help to push me, a deer, through a place with a low ceiling because they think it would be funny if a deer rode a metro."
    ],
    "2024-06-19": [
        "I am visiting Croatia and I have a night to see around. I decide to take my juggling balls out and I find a cab and I ask to go to a night club. Everything seems a bit sketchy. One guy says he will arrange a cab for me, and then he and another guy pick me up on a convenience store parking lot. I only have 50 euro and I don't know how much it will cost. I am a bit nervous about everything. In the car I consider asking then to just take me back to my hotel. I think it may be dangerous for me to even juggle while at the nightclub.",
        "There is a group of me and family on vacation. We go to a restaurant that is run by an older couple. It is kind of their thing that the service is really slow. It is like a meditation restaurant. Uncle Allen is with us. After we eat we all leave, I think we go in a couple different vehicles. I don't know where we went, but we end up coming back to the restaurant. The older couple isn't around when we get there, but Uncle Allen helps himself to some strawberry cake in the refrigerator."
    ],
    "2024-06-17": [
        "Taylor Swift is at a concert in the driftwood house. It is before the concert and she is walking around with her entourage. Somehow I get her shoes and her hat and I am walking around in them. She notices and makes some comment about them. I decide I want to teach her how to juggle so I prepare some juggling balls for her. I don't actually teach her, but I think she sees me juggle some."
    ],
    "2024-06-16": [
        "There is some sort of tourist attraction that I want to go to. Security feels like airport security at first, but it gets even more strict. They make me get into my underwear and even take off my shoes. Then a security guard pats down my underwear. I am making jokes the whole time, asking things like \"are me balls bigger most peoples\". They say they want to search through my bag. The security lady says she wants to take the religious things out of my backpack. I have no idea what she is talking about. I start to think that maybe I will just not get into this place."
    ],
    "2024-06-15": [
        "There is a beached shark. It is in a little bit of water because there is a small creek running down the beach from the shore to the ocean. People are trying to push the shark into the ocean but it isn't working. For some reason I decide it will be better to try to get the shark into deeper water by going the other direction away from the ocean."
    ],
    "2024-06-12": [
        "So we're younger I live at home with Bethany. And she goes to school. 1 day I knew she's holding something and it turns out to be too tarantulas. She says that she got them at school. She says that she is generally against cages, so she wants to just let them have an area of her bookshelf that is their own area and they can come and go as they please. She thinks they can just wonder the house to find bugs to eat. I tell her that with mine I used to have to go buy crickets from a pet store. I go to the pet store and I ask for a bag of crickets. They give me a bag of large, hard-shelled Beatles crustacean thongs. The bag of Beatles crustaceans is packed full. It costs $8.25. After I pay, I explain to someone that i was planning of getting a bag of crickets. Someone says they will go get me the crickets. Someone else hands me a tray of dirt and asks if I will go dump it outside of the gate. The store is closing. Someone says they got the crickets. I see a bag I think has crickets in it. When I'm holding it, a bunch of mud falls out of it and onto me. I ask someone if there is a price difference and they say yes, 5 dollars. They are all sitting on the ground and seem tired. I tell them to keep it as a tip."
    ],
    "2024-06-10": [
        "I'm in India there is in an Indian guy. He has knife and he goes to a couple vendors and tries to cut one of them. The vendor also has a knife and is faster. He cuts the Indian man's wrists and he starts to bleed. The vendor bandages him up and he starts to heal very quickly.",
        "There is a group of people working for a politician. I join them, we are working on putting a floor together. The politician shows up, she is an attractive woman In her 30s. I ask her on a scale of 1 to 10 how much she loves being a politician. She doesn't answer clearly, but I assume she thinks it's about a 6."
    ],
    "2024-06-08": [
        "I was at some place like a boat launch where there wasn't much time. I an in a team competition to be ready first. As we are nearing the end, I use to get completely on the mimens team. I realize I have to poop. I get permission but it is really close. While pooping my foot hurts, I go to wipe it off and it hurts back? My toe rips on the foot wound because there is a huge piece of glass. The other team mates notice now I'm bleeding"
    ],
    "2024-06-07": [
        "I'm in a class, it seems like college. A girl and her friend come and sit next to me. They are both nice, but I can tell they think i am a little strange. We tall some in class, but then leave. In the cafeteria one of them sits next to me and then her other friend shows up. The girl tells her friend that I call the professor sir, and I say yes, because he is in a position of power. Later on I either hear or say a pickup line to a girl outside of a store. It is \"hey, do you want diamonds in your rough?\""
    ],
    "2024-06-04": [
        "I'm on a movie set in a really hot place. I don't have a major job in the production. I am watching filming some and someone gets stabbed in the neck. It looks so real, I think they actually did get stabbed. Other people don't seem to think so though. I decide to go get everyone water. I find dad's key in a house and go find his car in a pretty full parking lot. Somehow I end up in the back seat with the car moving. I can steer, but i cant reach the gas or break, so I'm trying to figure out what to do. Next thing I know, I'm in the front seat with dad and we are on our way to get fast-food breakfast sausage sandwiches. I say when they came out I ordered 100 of them. He is surprised, and I say I was joking. We tall about how if you but 100 of then it is $100, even though 1 is .99, then we realize you actually get 101 for $100."
    ],
    "2024-06-03": [
        "I am in a foreign land made up of many little islands. Dad is around somewhere, and we plan to meet up. Hatice is around too. This island world feel like im in mystical adventure. We have location sharing on our phones and we can use it to try to meet up, but things don't always update, so the locations shown are often out wrong. Eventually I meet up with dad on a tiny island and we meet some distant relatives. Dad introduces me to a guy that looks identical to uncle mike. I naturally go to give him a hug because he looks so much like uncle Mike, but he moves to shake my hand instead. Dad has to go get a boat to somewhere, either with a dog, or to go get a dog or something. He tries to make sure that we will be able to easily get back. I wait for him for a bit, but he doesn't seem like he is coming back. I try to predict his route and I go to another island that is ahead of him. I get there, and there are some people there. There are also very intelligent and friendly whales of various species that are sticking their heads out of the water and interacting with people just off of shore. Some whales are smiling and playfully spitting water at people nearby. There is a whale that is using a fish like a telephone while people watch and laugh. Dad never shows up and so I leave. I meet up with a friend and we try to find Dad together. We are in a fancier and busier part of the island world. We go to a restaurant and think Dad will show up. I start doing some sort of ridiculous magic in the nice restaurant that makes a scene. I think my friend has to take me away from the restaurant. I remember seeing a map of the whole island area. I remember thinking that this is kind of like a country, but not really, it is so lawless, and so different from anywhere else in the world. I think it is called something like Micronesia, some place that I never paid much attention to."
    ],
    "2024-06-02": [
        "David Blaine with Nick in an icelandic Library. I'm with nick at a library in iceland. Nick needs to go do something later, but for now we are a part of a large group at a private David Blaine magic show. We are all sat in a circle in folding chairs. David Blaine is doing card magic. I have to go to something on my phone. David mentions I'm not paying attention and so I go back. He asks someone to name a card. He does a quick manipulation so I assume he is using a stacked deck. I ask him if I can ask him if he us doing the trick in the way I think. He doesn't say no, but I think he doesn't want me to ask him.",
        "Airbnb, convention, enormous chipmunk cartoon. I'm with Nick and more family members. We are staying at two separate airbnbs that are close to each other. There is some sort of issue with the heater or generator or something. Nick and I take a bus to some sort of convention. At the convention they pass out a bunch of medals, everyone gets some. We take the bus back toward the airbnb. On the way I notice 4 huge RVs, each one looks like one of the 4 famous chipmunks, like Alvin. I notice other things around that look like them. I decide to get off the bus early to go fake some pictures. A few other conference goers also get off at the same stop.The bus driver hands me a medal and says someone forgot it. I call to the convention goers about the medal and one takes it. Nick says he is going to work on the Airbnb. At the very end Tony Henchclief says he uses offensive words so that he can cross them off so that they won't have as much power any more."
    ],
    "2024-05-31": [
        "I'm camping and get to a trail head and there is a group there camping. There is also a car there that doesn't seem to like campers. They are backing into someone's camp and crushing stuff. They drive over someone's guitar and get into a fight with them. I walk over to them to tell them to stop. A friend of the psycho in the car throws something hard and hits my head.",
        "I am travelling with a group of people. Nick, dad, an uncle and more people are there. We stop at a restaurant, but it is very small, so some of us wait outside while others look at the menu. The menu is like flashcards with each item on different cards. Nick was in their briefly with dad and the uncle, then Nick came out and I went in. Dad showed me that my options were beans or eggplants in a burrito. I chose beans, and then dad told me to ask Nick what he wanted. I went and asked Nick what he wanted and nick said he wanted to use dad's laptop, and he was a bit upset. Nick explained that the uncle recently had been in an iron lung, and now he just had his chest seize up. The uncle didn't care about it, and this annoyed nick."
    ],
    "2024-05-30": [
        "I am living with hatice, and her grandmother dies. Her mother comes to stay with her and so I need to move out all of a sudden. Hatice is trying to secretly tell me something as I am leaving, but I don't understand what it is. Something involving symbolism of forks or knives attached to a fist like wolverine. I set up some fairytale audio for hatice to hear from inside my backpack.",
        "I'm at nicks house and Maggie has been given the job to lead the construction of a castle in the back yard. after just 48 hours she has made a lot of progress. She said in that time the have accomplished 1,000 hours of man labor. The castle looks to be about half built, just the lower half. I am given the job to hold a key onto the construction site. I am watching a show on my phone. Something happens with Maggie and one of her kids at school. She is on the phone yelling at the principal. I am trying to turn the volume down on my phone, but it isn't working."
    ],
    "2024-05-29": [
        "I go to some poorish, but hip country with hatice. She goes to bed one night, but I go exploring. I am outside of a grocery store and I see the shadow of a guy selling weed to the shadow of another guy. I ask if I can buy some and he tells me to wait. I wait and the drug dealer talks to me. I say I haven't smoked in 2 months and he is very surprised. I ask how much it costs and I can't really understand, so I figure I'll just hand him a bill and see if it is enough. It is too dark to see the bills anyways.it is enough. All the lights come on and there are a bunch of people I couldn't see hanging out in front of this gas station. He tells me that the cops are coming and so everyone is fleeing. I thank him and run away. Down the sidewalk there is a street market with a whole bunch of minions for sale. The minions on the sidewalk are stuffed animals, but somehow digital as well, they can change and they are all in sync. I eventually get to a square with some people hanging out. There is amazing graffiti. A building has a graffiti man on it and that perfectly mirrors a skeleton on the floor of the Plaza. When I'm trying to get a picture of it, some guy with orange hair gets mad and thinks I'm taking a picture of him. His friends tell him to calm down, but he comes over and wants to see the picture. I show him, but I'm shaken up and decide to leave. When I'm leaving, I challenge a couple boys in flip-flops to a race. They are fast, but I have endurance. I get to an area nearby with a bunch of bridges going over a canal. Someone is slackrope walking next to one. Many of the bridges have people dancing and dj set up around them. Undecided u want to film this and i take my phone out of the case. Some guy grabs my phone, but I'm able to hold onto it. I yell at him and he wanders off. I try to put my phone back into the case, but it isn't fitting right."
    ],
    "2024-05-28": [
        "I'm around savage and dad. I'm going to go somewhere, I have some sort of area like a futuristic tent or something, that I agree to let savage use while I am gone. Savage has a similar area, and he has tons of writings and drawings in it. When savage isn't there Dad starts organizing savages stuff. Savage gets some sort of a dummy of a famous political guy that he wants to put in front of my area. I don't quite like the idea, but I'm not sure why."
    ],
    "2024-05-26": [
        "I am at some sort of military college with spoiledish weak kids. I don't remember most of it, but we are bowling at school, we mess around some, but we are not very good. The bowling pins are strange, they are kind of cubish, and at the end I set them up with an obstacle in front of them. I roll the ball with side spin so it gets around the obstacle and hits the pins perfectly and hits the cube shaped pins into the hole. My friends are very impressed, but we have to leave. As we are going into the woods, one of us realizes that they are in their socks, the rest of there clothes are a military gear. I wake up into another dream, but I remember this dream and feel like I need to tell someone about it. I am at a music festival and I am friends with celebrities. Miley Cirus is there, but just in the background, I am friends with her and I want to tell her about my dream. She is on an illegal drug. She has been pretending that the drug is plant food. It is a thick yellow liquid in a large plastic bucket. There is so much of it, she has been splashing it ok trees and bushes. I help her do this for a bit. Some bad people have put a curse on her sister that has made her brain work weird. And we need to go rescue her. We find her and try to help her somehow."
    ],
    "2024-05-25": [
        "I'm at a beach. I have something that needs to be inflated, but I am having trouble finding something to inflate it with. I find a kid with rubber hamster toy that they want inflated. They have a pump so I offer to inflate their rubber hamster toy if I can use their pump for my ball as well. They agree, but when I fill their rubber hamster toy I over inflate it and it breaks when I remove the pump needle from it."
    ],
    "2024-05-24": [
        "I'm getting on a ferry in a place like nyc. It is the 2nd part of a round trip. I don't have my ticket pulled up but I get on anyway and tell the ticket checker I'll get it pulled up. The ferry is crowded. I sit down kind of squished between people and a fairly attractive girl kind of puts her arm around me. I wrap my arm around the girl for a sec, but then I get up to go throw something away. I go stand on my own in the ferry and feel a little bad because the girl was not hatice. I find a stairwell on the ferry where people are lined up to get off the ferry. I feel a little bad because because the place where I get in line merges into the front of a line where a lot of people were already lined up. More people start to line up behind me."
    ],
    "2024-05-22": [
        "I'm driving and I have nick and the kids in the car.There are lots of people on the side of the street. A little boy jumps in front of the car. I slam on the breaks. Someone looks under the car and starts screaming. I get out and look and the kid is under the car. I can see that the kid is alive and so I start yelling that he is alive. I pull him out and he yells to his family. I had smoked some weed earlier and I feel awful. I know the kid jumped in front of the car, but still, if I hadn't been high then I would have been able to respond faster. I try to very carefully continue on driving, but I am very shook up. I keep thinking that I'm going to go to court for this and go to prison because I have weed in my system."
    ],
    "2024-05-21": [
        "Hatice and I are wondering around in turkey, we see some of her friends. People are starting to guess that we are together. We have something we are trying to do, but we keep getting distracted. We meet up with nick. We see a reenactment of a strange event that I know is a reenactment but nick and hatice think it's real. Someone is messing around with a bar and two people dressed as purple ball butts go and mess with the bear thinking it is a person in a costume and the bear bites one of their hands off. Hatice is annoyed that we aren't doing the thing we meant to do and keep getting distracted. We go to a place called the belly room and help them prepare for a show. It turns out nick is trying to get a job there. There is a big lady in charge there and she gives Hatice some breadsticks with medicine in them."
    ],
    "2024-05-20": [
        "I either get an airbnb or go to visit someone. The house is in the jungle or something. I go to the backdoor from the inside of the house and outside there are cute ball-shaped baby panda bears. There are also cute ball-shaped baby brown bears trying to get in through the backdoor. I need to poke them with my foot to get then to go back outside. Later, I go out to the front yard area that is like a field and people start showing up. Everyone is so weird. It is like they are zombies, bit not the scary violent kind, just mindless people that are acting strange. I try to talk to some of them, but it doesn't really work.",
        "I'm in a poor foreign country with other people. We are deciding what to do and we find out about a place to go that seems really cool. We learn about a place, but we need to take a bus there. The bus will cost 100 dollars. We have some trouble finding the bus. We find it at a gas station while it is filling up. I notice that the bus pulled into the station in the wrong direction so it's tank is on the wrong side. For some reason I feel responsible for this, but I don't know why. I go up to the bus pointing to try to tell the bus driver, there is some confusion and the driver thinks I'm trying to board, and I'm not allowed to yet. The fills us and goes to the place where we are allowed to board. We put our luggage underneath and I'm a bit sketched out by it because I can see an opening under the bus. I keep rearranging my luggage in the compartment under the bus. I go around to the other side of the bus and notice some people climbing up the side to get in through an open side. I didn't realize until now that it is a doubledecker bus. When I get up there, the bus is fairly empty in the back except for some spread out sleeping babies. I get told that I wasn't supposed to climb in through the side. I am asked for my ticket and it takes me some time to figure out which paper is the ticket."
    ],
    "2024-05-19": [
        "I am a part of some sort of cult. I don't know what the mission is, but we are very much against anyone who quits the cult. They make new members give all information about loved ones and family and if anyone leaves then they go to kill their families. Gradually the members start to each look more and more like each other. They shave their heads and wear the exact same clothes. They have a saying that they use a lot that ends in \"lazim\". There are a couple members that seem to be the most important. A tall man and an evil beautiful woman.",
        "lucid. I am in nyc, in a crowded metro. I leave something there that i think i don't need, like an old cell phone. I go home to hatice and i realize or hatice says she wants the thing i left in the metro. I go back to find it, but the metro  is crowded. I cant find the broken phone, maybe i see someone grab it. A black guy in a crowded metro station gives me a packaged selfie stick case with a broken case. I'm trying to get back home, but I'm a little lost and I am running and I notice the guy is chasing me and saying something to get my attention. He wants his broken selfie stick back. I give it back and I keep running and I see a human foot sticking out of a large garbage bag. I keep running and making big jumps onto things. There are crowds of homeless black guys. Someone tells me I am in a bad gang area and I should leave. I'm lost and can't get out of this area. I see more garbage bags with body parts sticking out. I start jumping higher and landing on things Like phone poles. I realize that I'm jumping so high that I must be dreaming and I could fly, so I start flying by pushing my arms like I'm swimming. I realize that I only need to push my arms in a swimming way to control where I go. I know I'm dreaming and the dream starts to fade, but I pull it back into focus somehow and the city skyview comes back into focus and I fly around some more. There is some place I am still looking for. After the dream fades again, there is a girl that says she has lots of dreams where she is told to drink Cola precum. when she realizes what she is saying, she is embarassed."
    ],
    "2024-05-18": [
        "Hatice and I are in some sort of college common area. We decide to make food.  She males mushroom slices in sauce. I make truffle sauce. She doesn't like how I make it and we get in a fight. She starts rubbing the mushrooms in the hair. I get angry and leave with a phone charger cord."
    ],
    "2024-05-15": [
        "I'm with some guy and we are trying to get across a large gap to a boat. At the bottom of the gap between the land we are on and the boat is deep water. On our side of the gap I a fancying construction site. We try to use a large piece of ornamental boarding as a bridge, but it falls into the water. We find a set of keys, but it doesn't open anything. The guy tries to take my picture with they keys, but I don't let him. I know we shouldn't be messing with this construction site and I don't want any evidence of me being here.",
        "High Stakes Build-A-Pool. I'm at a casino, I think hard rock. I am watching a high-stake poker game that somehow takes place on a pool table. Each player has a few balls of their own that secretly have numbers and suits that only the players know their own balls values. The exact rules are not clear, but there is some sort of proximity situation that determines which of the players balls can be played with which of the communal, openly known balls. It seems like a standard game here. So much so that I don't even think it is seen as a weird game here. They are playing high stakes, but I don't know how high. I leave and come back. Now the table is even bigger, and at the beginning of each game, the players take turns placing obstacles all over the massive pool table. There are things like plants and sxultpites on the large pool table. There is a crowd watching the large pools table that is on the floor and covered with various kinds of obstacles. They are trying to get more people to play with them. I ask how much they are putting into a single game. And one of the players says $13,000 to $15,000 about. I consider calling nick to tell him, but my phone is almost dead. The player tells me that he can trade btc for me.",
        "Indian Fortune Van I'm with savage in a city. We need to change money, a van comes by and savage says we can get Indian money in there. We do and are walking and we run into a girl they savage used to date or something. Someone comes by and asks if we want to do a fortune telling thing. They say yes and so we get in a van. There is an old Indian woman fortune teller in the van. They say the cost is 30-50k of their currency I think. This is expensive and I'm reluctant to pay. They say we each have to pay that amount, and so I do."
    ],
    "2024-05-13": [
        "I was with family in an attic living room sort of place. We set up an AI on a computer. I stood in front of the computer, but facing away from it and I asked it to tell me something about myself. It responded with something about Vayla, this really surprised me because I thought it was a fresh AI. I went to use the toilet, it was oddly in a living room. While I was sitting on the toilet I accidentally peed on the seat and the floor. The toilet wouldn't flush. Nick was there and i told him that the toilet wouldn't flush. He came over to look and the toilet was mainly filled with ramen noodles and just a tiny bit of poop. He tried to flush it and it worked. One of us mentioned something about hooking up the AI to a gas pedal."
    ],
    "2024-05-12": [
        "I'm with Bethany and her toddler, not sure who exactly. We need to go to Phoenix, Arizona for something. I ask if she knows how hot it is there and she says yes, we check online and it is only in the 80s. We are in a waiting room. Bethany is holding her phone and a centipede comes out from a crack in it.  I knock the centipede onto the floor. I step on it and it turns into a smoothed pile of jelly. I go to the bathroom to get some paper towels. There is a dirty knock-off version of my jacket in there hanging on the wall. I go back out and clean up the the crushed centipede. I tell the toddler to keep his hands out of his mouth because I don't want him to eat the centipede guts. There is a manager that talks to Bethany some, and then later he takes a bunch of waiting people with him somewhere. It turns out we have to wait and come back layer. Jeff Arcuri and Daulton show up and we ask the manager where we can find an arcade. Jeff, Daulton, and I head there with plans to meet Bethany and the kid there. I end up alone in an elevator with Jeff and I ask if he knows Kill Tony and if he would do it. He says he knows it, but he assumes I mean as a bucket pull, not a main comedian. Later on we are riding in a van. I start to explain how juggler show the thing they practice, and magicians hide it. I want to ask which way Jeff sees comedy. Does he hide his skill or show it."
    ],
    "2024-05-11": [
        "I'm with Hatice. We are at a camping place with other people. I kind of remember us struggling to set up our tent, but I think we end up getting it. It's weird, I also kind of remember it being easy to set up."
    ],
    "2024-05-10": [
        "I was in a video game. It felt like vr, but somehow also a 2D scrolling game. There were different sections of different colors. The color was an indication of how difficult the level would be. You could sort of choose which color to get into depending on how much of a challenge you want."
    ],
    "2024-05-08": [
        "Biden made a an official statement that the US has stopped helping Israel in their war on Gaza.",
        "I'm at some place and there is a woman who really like me, I think she may be my ex. I am carrying her around the streets at dusk. We are in a quaint city in the evening. The woman is very impressive, she is beautiful and some sort of college graduate."
    ],
    "2024-05-06": [
        "Hatice family. I'm some place like the bird drive house, but it is the house that hatice and her family lives in. Hatice and I keep some some distance until we think everyone has gone to bed. I sneak into hatices room and take off my shirt somehow volkan sees and us very upset. Shortly after that aliye comes to talk to Hatice and I'm still there. Aliye is saying how awful this is that i am 17 years older than Hatice. She isn't trying to hide how much she dislikes me.",
        "samurais. I'm in a place that is presumably japan. There are samurais that are going to give us lessons. We have a large group with us including kids. The lesson starts with the samurais hitting fake dull swords together in a sword fight . One of the kids is trying to boss around the samurai instructor I yell at the bossy kid kid"
    ],
    "2024-05-05": [
        "I am at a bus station with hatice, but I'm getting on a bus alone. I get in line and as the time comes the people from the line start to get on the bus. I get on the bus but the driver tells me I'm on the wrong bus. He shows me the right bus area, but as we are looking, a bus is pulling away. I hope it's not my bus."
    ],
    "2024-05-03": [
        "I have a lawyer. The lawyer says that for every unpaid 1,000 dollars in taxes, you have to spend a year in prison. This freaks me out and so I wake up, but still in my dream and I try to google it. Later on I rent a house for nick, Audrey, dad and more people to come to. I find some weird poker game online and play for a bit. I go to my bedroom. I have some adult toys and books in there. Later nick and Audrey are on the way over so I clean up some. I show them the computer poker game. I talk to nick about what the lawyer in my dream said, and nicks that is was wrong. He says that if you don't spend more than 75k by June 25th then you owe no taxes for that year. This is a relief. I tell them I was worried and was up googling it in the middle of the night after my weird dream. Later on dad comes over, and the 4 of us smoke a joint. I tell dad that I never though he would smoke week. More people come over. In texting someone's mom but I keep getting distracted. There is a guy at the house with mental issues. I find out 25 some people will be tonight."
    ],
    "2024-05-02": [
        "I'm at a place with an airbnb. It isn't far from mom and some other people. I settle in at the airbnb and I go to mom and them. There is a movie on amazon we were planning on watching. I plug my tablet into the TV and try to find the movie, but it's not there. I realize it is because my amazon subscription expired. I don't really want to turn my amazon back on because I will be leaving the country soon. Mom says she will use it and she says her birthday is coming up. I agree to turn it on, then I realize mom's birthday is 9 months away. I mention this and we all laugh. I set up the movie for them and I leave to go to an outdoor coffee shop. I get there and realize that I never plugged my tablet into the wall and my battery is going to die. I run back to the airbnb and plug it in. I go back to the outdoor coffee shop and I plug in something else. I leave my stuff there and go to a different coffee shop. The waitress comes over and I am ordering coffee and French fries when I notice that it is raining. I say I have to run because my stuff is plugged in at an outdoor Cafe, but i say ill be back. My friend says that's rude. I am dodging between people. I hit a fat man's belly on the street."
    ],
    "2024-05-01": [
        "YMCA sleepover. I have some sort of sleepover at the ymca with a couple other guys, one of the guys is black. We mainly have the ymca to ourselves. We put our sleeping bags on the basketball court floor. We casually play basketball for a bit. I ask the black guy if he can touch the rim. He says barely, but then when he goes to do it, he is as tall as the hoop. It turned out that I accidentally bumped a button that lowered the height, it was funny."
    ],
    "2024-04-30": [
        "Messed Up Order. I am out at a nice restaurant with hatice and someone else. There is a table of army guys at the table next to us, 2 are macho and 2 are feminine army guys. Our table orders drinks and light food. I get a vodka with ice and an olive and tomato sauce, but it's not a bloody Mary. We are making some jokes and we start talking to the military guys. Hatice gets up to go to the bathroom or something. I ask for another drink. The old waitress is distracted and she says i want a cranberry rum. When hatice comes back she has a potted plant with flowers in it. She says it is to the army guys from her and her friends, she says it is from all 3 of us. I say it was her idea, and she gets all the credit. One of the feminine army guys starts taking the plant apart."
    ],
    "2024-04-29": [
        "Lucid Mom Call Crazy Girl. I'm with nick and someone else at a nice shopping area with outdoor plazas and stores. We are going to meet out with a girl I've been kind of dating. We meet up with her and go into a small convenience store. For some reason she gets into an argument with the cashier. The girl I'm kind of dating turns off the lights in the convenience store. Then she opens a fuse box with her foot and starts flipping off all the fuses. Lots of things start powering off in the convenience store and even outside. Nick and I take off running and the girl runs in some other direction. I tell nick I will try to call her so we can meet up with her again. We need to be careful though because if we get caught with her then we may get in trouble too. Security is definitely trying to find her. I am trying to call her with a device that is just ear buds connected by a wire. She is not answering. Somehow I start to hear moms voice through the headphones. I didn't call mom, and mom had no way to call my headphones. I realize that this makes no sense. This makes me realize that I must be dreaming. I am very confident that this is a dream, but nick and a few other people are still there with me. We are outside in a parking lot and I quit trying to get a hold of the girl. I tell my small group of friends that I want to show them something. I ask for a sheet and I put it over a plain colored box. I tell someone to pick a color and when I remove the sheet, the box is the color I said. I feel that tight-wire of lucidity where I am about to wake up, but I keep feeling like the scene of us is real. I do a few more magic tricks that would be amazing if I were actually doing. Anything expect to happen, happens. I end up doing a few magic tricks in the parking lot before waking up.",
        "Travel issues. I'm travelling, but not sure where to go. I'm on the west coast in southern California. I decide to get a sleeping bag for cold weather. I think about calling Savage to see what he is up to. I wonder around some. I am on a bicycle, and i get chased by a cop car. Somehow in the chase i fall off my bike and it rolls into an intimidating halfway house with big scary gang guys. My warm sleeping bag flies into another scary place. I message savage and hear back right away. He is up in the northwest staying something he said is really nice. He is camping somewhere that the frost is just ending. My warm sleeping bag would have been great, I'm  bummed that I don't have it now.",
        "Wet Garage. I am sleeping in a garage and I have a sky window kind of above my bed. I left the window open and the area around my bed got wet. I didn't close it though, and the next night it happened again."
    ],
    "2024-04-28": [
        "Jude Toilet Golf. I go to visit bethany and her crew. When I get there, Jude shows me a golf ball in the toilet. I joke that he should try to hit it with a golf club and I'll try to catch it as soon as it leaves the toilet. He thinks I'm serious and he splashes toilet water on me. I go start to change to take a shower. I get distracted because someone brings me their graded school work. Little Meave is working towards something, and she has a perfect paper with a star on it. We all go somewhere where Jude has a competition in a large ball pit that is a large circular track. He has to throw a ball in the ball pit and then go there and throw again to get around the track. I find bethany in the kitchen with the newborn baby, Noam. Noam can already stand despite being just a week old. He uses something like a support suit, almost like a baby Ironman.",
        "Salk Lake Stalker. I'm walking around outside in the streets of Salt Lake city. I meet up with a few friends at a coffeeshop. As we are leaving, we get stopped by a homeless girl wearing all white and a couple male friends of hers. She asks for money and i say no. They stand in our way to leave and we have to kind of push through. The homeless girl in all white clothes follows us so I decide to run. She runs too follow me, but I am able to lose her because she is not in good shape.",
        "Water Vegas. I am in Vegas and I have the ability to fly. I am on the phone with someone, they are like my boss or they want me to work for them. They ask me go look around at arial shots of the casinos and tell them if anything unusual. I tell them I found a casino that is surrounded in water so it is like an island. Then, I realise this very common In the southern part of the main strip of Vegas, most casinos are islands from the sky view. I can see some casinos are even complete submerged under water. I mention that people would pay to scuba dive in these casinos.",
        "Shredded Shirt Repairman. Hatice and I are home and we hear a key in the door. It is the landlady and a young repair man in a shredded white t-shirt. The prepare man was wearing a terrible ripped shirt and asks if he can wear one of ours. We say no and he takes one of hatices shirts anyways. Hatice is hiding behind a large tv because she is embarrassed to be in her blue pajamas. I'm in boxers and so I put on pants. There is another 20-something girl who points out that there are 2 dead baby rats on the front porch."
    ],
    "2024-04-27": [
        "Boat Adventure. I dont remember much, just that I'm on a boat. In this world, there are boats all over on the ocean. I know we have a motor on our boat. We travel around doing lots of stuff on the boat. After awhile, there is something that we have to do around big boats. We get too close to a big boat and get pulled underneath it. The big boat crushes the engine of our big boat.",
        "Train Adventure. I remember very little. We are in a train track tunnel. The train comes very close to us, be we are OK o think.",
        "Parasail Adventure. I'm in a rural town and there are a couple guys with large parasails on top of a truck that is stopped at a traffic light. They call the driver of the truck and tell them that there are people on their roof. The truck driver thinks they mean the roof of his building, not his truck. The building is very tall. The parasailers think their prank call is funny. They parasail off the truck roof. I think this looks like so much fun and somehow I join them in their parasailing. It is so much fun. Pretty much right away I'm parasailing between trees and stuff. I realise I got a very short, blunt text from mom. I check and I see that I had told mom previously that i was on a dose of L1. I feel like this was stupid of me. I keep parasailing and i go over a lake. Those other two guys are watching me parasail. I decide to go really high, and i do and it is such a rush."
    ],
    "2024-04-26": [
        "UK Prisoner. I am a prisoner in great Britain, and I do not know why. They are having a festival that is all about a big elaborate rube Goldberg machine. It is obvious that it took a long time to build. It is massive and goes through the front yard of the palace. For some reason, I get to watch it up close, and I even see some trial runs. Finally, the time comes to do the official run, and lots of people from the country are watching. Presumably there are even cameras and people are watching from home. As it is going in its official run, sometimes it gets stuck, or messes up, and people have to manually continue it by giving it a nudge. Eventually, the small metal marble reaches it completion point. People start packing up, and the prime minister tells me to wall with him. As we are walking, he starts to tell me the uk prime minister frees a prisoner every year after the rube Goldberg machine. This is very exciting, and I think that he may be talking about me. We continue walking, and get more into his chambers where there are not many people around. We see someone on the floor, presumably dead and murdered. I say that it is peculiar and the prime minister agrees, it is all very much like Monty python.",
        "Blind Ski Jump. I'm at a ski resort. There is a blind jump that nobody can see over, but everyone must do towards the beginning of the first real slope. Someone like hatice is standing at the hill to watch people do it. She stops me when I try to jump there because she says it is dangerous. I am annoyed by this because I want to do the jump so that I can learn."
    ],
    "2024-04-25": [
        "Dumb 3-card Poker. I was at the Driftwood house, nick is there, and a couple other people. There is an older guy who wants to play some sort of 3 card poker variation. In the first hand I get 3 4s, and this guy explaining the game gets a 3 card straight. He makes fun of my hand as one of the worse hands and he says he wins with his straight. It's ridiculous though because my hand is way more rare."
    ],
    "2024-04-24": [
        "Car killer. I'm with some people at a house. There is a bit of stuff that happened before the climax of the story, but I forgot that stuff. What I do remember is that there were three of us on the street and a car was coming, so the three of us got on the side of the road in a row to avoid the car. The car swerved down to hit us though. I think there was another car behind that car because I remember describing what happened by using 3 fingers from one hand while using 2 fingers of another hand. The first person in our row of 3 got hit by the first car. I think we knew the driver of the first car, they were a friend that was in the earlier part of the dream. There was some court case that made it so one of the people involved we were never allowed to see again.",
        "Poolside Problems. Nick, kaius, and I are at some sort of resort island. He have a hotel for a couple days, but we want to stay longer on the island. We are hanging out at the hotel pool and someone from another pool with a clipboard shows up and starts trying to get us to stay at their hotel. They are telling us what a good price it is, and how it has nice beach access. I ask nick part way through if they know we need 3 beds, and the clipboard worker seems surprised to hear this. While we are talking to them, there is some yelling in the pool. It is kaius and some other kid that are upset with each other. I think kaius was splashing a lot when he was swimming, and it upset a black kid. The boss of the clipboard workers told them all to leave because they don't want people like this to stay at their hotel anyways. Nick goes and gets kaius and takes him to an outdoor beach swimming part of the hotel. I walk around the pool some and look at the signs on the wall."
    ],
    "2024-04-20": [
        "Cardboard Jacob's Ladder. Savage and I are walking home from somewhere and we pass an open garage with a man and a kid in a wheelchair. the man tells us that the wheelchair kid can not speak. he tells us that it would be appreciated if we make a \"jacob's ladder\" out of cardboard. I end up trying to make a \"jacob's ladder\" wallet instead. There is a little girl there that can speak. I ask her if she knows any spanish and she says no, so I teach her how to say \"Hola\"."
    ],
    "2024-04-18": [
        "Pee Heist. I'm with Nick at an important office/laboratory sort of building. We are not supposed to be there. Nick is stealing something and I am helping watch out for security. At one point I have to pee and so i find a makeshift bathroom and i pee into a container. People can look through a window in a door and see me."
    ],
    "2024-04-16": [
        "Forest Bear Hike Without Hatice. Hatice and I go out to a national forest. There are other people around the woods. Hatice and I get separated. At some point I see a huge bear in a tree with a couple babies. This makes me worry about hatice. I try calling her, but it goes straight to a foreign language voicemail. I get closer to the bear and see there is a guy in the tree taking a selfie with the giant bear. I keep looking for hatice and I find a nice big pit with a pool in it."
    ],
    "2024-04-14": [
        "WWIII Boating. WW3 starts and I am with a military captain. I am trying to convince him that I am a hacker and I need tools to hack. He doesn't seem to believe me. I leave him and go to a grocery store. There is an announcement that everything is free. I find someone in a back room that has filled the pipes with a blue liquid explosive. He has made an escape route with plastic tubes that are like slides. I escape just as the store explodes. I get to a boat. I can fly to a fig tree. On the way to flying to the fig tree i fly over another boat where someone is eating some figs. I consider going to get scuba gear. I end up leaving with 2 people because we know where a sunk boat is. We unsink the boat. We hear that japan has lost 4 states so far in the war."
    ],
    "2024-04-13": [
        "Hatice's NES. I'm at Hatice's family's house. They have an NES and I am playing some sort of game that is part arcade and part trivia. I get to ask questions and the answer is RAM and on the console there are buttons to reset the console and stuff and they are labeled with single letters R, A, and M and so I spell RAM with them. This was dumb because I was supposed to use the controller to spell the answer, not push those buttons. It crashed my game.",
        "I'm at college. There is a vegan meetup club. I go and there are about 3 guys and 1 girl. I leave and come back and there is 1 girl still there. We are supposed to play 1v1 basketball. I know I can win easily, so I don't play hard against her."
    ],
    "2024-04-12": [
        "Winter School. I am enrolled at a class at a really unique ice school. The only class i seen to be in is a combination of literature and winter/water survival school. We are preparing for a test. We need to go around on a kayak in a snow covered lake and get to different places where there are questions. I find one of the areas, but then I struggle to find the next. The snow covers everything and it is beautiful."
    ],
    "2024-04-11": [
        "Spooky Garage Attic. I'm with a group of adults at an abandoned house and disconnected garage. The garage has an upstairs attic. Me, Save, and Che;sea are in the dusty garage attic. We hang out up here on a mattress. We go and explore the abandoned house some. I decide I want to start a bike trip so I go get a bike. I come back and say bye to them. For some reason I stick around though and hang out in the garage attic. While we are there, a group of kids come by and find us in the garage attic. I write some words in an over-sized, dirty drawing notebok. Everybody leaves except for me. I grew up in this area and had memories here. When I'm alone, a black teenager comes by. He says his name and I recognize it. I think he must be the son of an old childhood friend with the same name. He actually is the childhood friend though, somehow he is still young. It turns out he is a ghost. He magically transforms into a skeleton. The skeleton turns into a pile of bones. The bones turn into a pile of dust with small bone fragments. I freak out in the spooky old garage attic. I start hurrying to leave. A group of kids with their teacher show up in the attic. I realize that it is Kaius' school. I talk to the teacher and she realises that I know Kaius.",
        "Indian Art Show. I was at some sort of large art convention with mom. We are staying at an airbnb in India together.",
        "A dream character told me that coffee will make my dreams more (something positive), but I dont remember what the something was."
    ],
    "2024-04-10": [
        "Office Shower. I get a job offer working in an office. It seems interesting, but I don't need the job. I take the office job anyways though. There are some of the main workers that I don't get along with, but I feel like it's not my fault. I'm told I can use the office shower by one senior worker, but when I'm walking around the office in a towel, other workers get upset.  I know I am on the brink of getting fired, but I don't really care so I just say that I will quit. I get told to go to the kitchen for a talk. A very important guy is there. He starts putting on rubber gloves. The woman boss who doesn't like me says the man who is putting on rubber gloves is going to kill me. Her face is very serious when she tells me this and she never jokes, so it is a bit scary. I get upset with her and tell her that this is an awful time for a joke. I am not sure if she is joking or not though."
    ],
    "2024-04-09": [
        "Poker Not Cheater. I'm in a place with new acquaintances, a group of guys. We are playing poker. On the first hand, the guy before me bets on the turn, I had a low pair, and he bet moderately and I make a huge semi-bluff all in ($400). He calls, and I don't get another pair or or anything, but I do get a 4 card straight. I show my hand immediately and he sees my 4-card straight as if it were a 5-card straight. He is upset and walks away upset. he slightly accuses me of cheating. He discards his hand as we walks away. I realize that he must have misread my hand, and I ask him what he had, but he wont listen to me. he is upset and thinking that he lost. Clearly he had the better hand I think, or he would not have bet. He realizes why i'm asking him what his hand was, I tell him that he can have the pot."
    ],
    "2024-04-08": [
        "Hired Skaters. I'm at a sort of outdoor commune with sportsy youngish adults. We are supposed to occasionally help important official people when they ask. The official people ask us to skate board in a specific park or area one day. There is a little disagreement about who will go, but some skateboarders end up going to the park. Later, we go to a park up on a hill. One of the skaters get their thumb ripped off by a car. I was standing a ways away, but i think the car drove away while where thumb was attached to it. At night we have a bond fire. I pour some gasoline on some dry grass thinking it will burn out immediately. It spreads fast and low on the ground. For some reason the fire is a very dull orange and very low and it is hard to see. The grass everywhere is very dry and the fire starts to spread. Bethany and Orson and some other family members are there. Orson takes off running and people chase him to keep him safe. A bunch of us try to stomp out the spreading fire."
    ],
    "2024-04-07": [
        "Life and Death Location. I'm with Nick and we are trying to find a place to go in a big building. There are other people also trying to find the place. I know that we need to get there before the other people do, but we have no real direction. Nick says that we should take a gamble and pick a direction and go in it. I think it is a life or death situation, so we really need to find the place."
    ],
    "2024-04-04": [
        "Chocolate Chase. I'm at a big indoor/outdoor resort. Something happens and kids and some adults are chasing me. There is liquid chocolate used as a weapon in the chase. At one point I am trapped and I cannon ball jump off of a balcony into a swimming pool to escape.",
        "Huge Laundry. I'm with the family at a new house. We are going to play a game. Before we play the game, I suggest we do laundry. We go around and gather up everyone's laundry and put it into a massive laundry washing machine. The Washer is like a massive wheel that is sort of like an empty version of the wheel from the Price is Right."
    ],
    "2024-04-03": [
        "Bobby From School. I was with Bobby(girl) from early high-school. We are in a house, and there were some other people around. We are older now. Maybe current age. She asked me why I used to tease her in school when I sat behind her. I felt uncomfortable talking about it there since maybe someone might hear me. We left the area, bit I woke up before our talk."
    ],
    "2024-03-30": [
        "Worse Diamond Hand. I'm Playing Texas holdem at a casino table. I flop a flush of diamonds. The guy to my right bets, I go all in, he goes all in for $35. He had the nut flush and I lost."
    ],
    "2024-03-29": [
        "Hatice Drowns. I get a short, official email saying that Hatice is deceased. It was a drowning."
    ],
    "2024-03-20": [
        "Erie House Wildlife. I'm at the erie house, nick and siri are there. There is wild fairly aggressive bear and some sort of big wild cat. I hold the bear off my poking at it with a big board."
    ],
    "2024-03-01": [
        "Juggling Ball Cutting. I am with someone in something like an underground shopping mall. We both have bags with juggling balls in them. We go into a small shop and the owner is sick and in a hospital bed in the store. I ask if I can leave the other person bag of juggling balls there. Later on we get the juggling back and I cut them all open."
    ],
    "2024-02-29": [
        "Woodsman Hunting. It feels like some sort of future where strangers don't trust each other. I am on someone else's property and I have a riffle. I genuinely don't want trouble, but I need to make it through their property. I come across them at a distance with their dog in some woods with high grass. There is a bit of a standoff on a long path through the woods and grassy meadow. They are scared and they do the signal to their dog that tells it to attack me. The dog charges at me and I aim the riffle and shoot. I shoot the dog and it retracts and slumps into the grass,  but it gets back up. The man aims his gun at me but I am faster and I shoot back. We exchange a few riffle shots while trying to hide behind trees and bushes. I am able to shoot the man before he shoots me."
    ],
    "2024-02-15": [
        "Siris boys. Siri and has boys are visiting the erie house. Some of the boys are using my bedroom. I walk into my room and two of the boys are being disgusting, they got poop on one of my two beds. This upsets me and I start taking all the sheets off of both beds. I don't recognize some of siris boys."
    ],
    "2024-02-12": [
        "Pool noodled. I'm at some many leveled building with savage and Chelsea. I have lots of expensive stuff with me, laptop, other electronics. There is a feeling of malicious news and lawlessness. There are two big scary guys trying to take my stuff. I'm with some people, we run into something like a classroom. We see a back closet area that is absolutely packed with pool noodles and other miscellaneous things. We cram ourselves in with the pool noodles and work our way to the back. Eventually the bad guys get the room emptied out. They manage to get my backpack and stuff. I tell them that their choice is between not taking my stuff or killing me, because if they take my stuff I will never stop hunting them down."
    ],
    "2024-02-11": [
        "Stolen Phone. Savage and I are at a hotel. We are both in the hotel bathroom. Someone knocks on the door. We open it and a middle aged skinny untrustworthy looking woman walks in. She is looking for something or something, and we get her to leave. After she leaves savage notices that his phone and wallet are gone. We find the woman, but she won't show her purse and pockets. We tell staff, but nobody does anything. We look all over trying to find her again. We try to get the police to come help, but there is nothing that anyone can or will do."
    ],
    "2024-02-04": [
        "Presidential Woman. I'm with someone, not sure if it ruby or hatice. Whoever it is, they become president of the US. We have plans to meet up and go to a club, but we are both out separately. I think earlier we tried to get food from a small food court, but nobody really had vegan options. One place said they had spaghetti and sauce, but thats it. I meet a girl who agrees to help me look for hatice/ruby. We go to a club to look for hatice/ruby. Me and the new girl get in line for a bathroom. I get into the bathroom, and I sit for a long time on my phone. When I get out people are waiting and I'm embarrassed for taking so long. The girl helping me look is sitting a few seats away, we talk loudly through some people. She gets up and I check my phone. My internet was off. I turn it on and see that I have a bunch of emails from the missing hatice/ruby. They say they are with a guy who is no longer helping them look for me. The guy says they are in bro competition mode now. There are other emails as well. The girl helping me look says they are from taipei. I say i was just there, but they don't seem to hear me."
    ],
    "2024-02-03": [
        "Infanticide. I'm with hatice, we are travelling and seeing family. We are deciding to break up. We are in a bedroom, just the two of us. For some reason I give her my electronic weed pen in the breakup. A bit later I decide that I want it back. I go and ask her for the pen I gave her earlier. I don't want to be obvious because she is talking to a father figure. The father figure is quite interested in why I keep asking her about a pen. She doesn't seem to know what I am talking about. Finally she realizes and she throws the pen in a fire. The father figure realizes and gets very angry. The father starts to turn into a fiery devil. I run to the bathroom to escape him. It is pitch black in the small bathroom. I don't know why, but the devil begins chanting infanticide over and over.",
        "Family Boating. I am on a small vacation with family. We are on a boat at a boat dock. The young neices are there on the boat dock. One little girl falls in the water and I help her out. Uncle Alan shows up, I feel bad about Logan dying and I hold his hand. It is awkward, we switch to holding pinky fingers."
    ],
    "2024-01-31": [
        "Lent Gel Pens. I am in some place with some other people that i am not especially close to. There are kids there. I have two nice gel pens that i really like. I got the gel pens for free. But they are expensive. There are some kids there. I let the kids use my nice gel pens. They press too hard and mess up the tips of the gel pens. The gel pen tips get flattened. I try the pens out some to see how messed up they are. I am disappointed, but it isn't too bad because I know I can get more."
    ],
    "2024-01-23": [
        "Colorful Alien Expedition. I'm on a mission to a foreign alien planet with a few other astronauts. At first we only see alien plants, then we start to notice colorful explosions like neon oil slicks in the distant sky. We continue travelling across the planet and we find something like a massive mushroom that has a head that could be thousands of meters high. The incredibly enormous alien mushroom is dropping colorful spores on us from the distant atmosphere. We find a green alien vine animal-plant hybrid. The alien sentient plant attacks me be shooting long vines out from itself. Massive chunks of colorful alien spores with powder coming out of them continue to fall from the sky. They explode on the ground. A friend releases the alien cine plant-animal green alien hybrid from its hold on me. My limbs are wrapped on alien vine arms."
    ],
    "2024-01-19": [
        "Roommate Drugging. A group of us have an apartment together. One girl tries to drug the rest of us, but for some reason it doesn't work on me. The mean girl threatens me by saying that if I won't take the drug then everyone will assume that it was me that drugged everyone.",
        "Whoopa Money. I needed money for some reason, so I emailed Whoopa(grandpa). Shortly after sending the email to him, I regretted it. I started looking into ways to get rid of it. I thought maybe I could get into his email and delete it. Then I thought maybe I could tell him that it was a scammer."
    ],
    "2024-01-18": [
        "Siri Airbnb. There are a few of us staying at an airbnb. Siri is there, he had his own room in the back of the house. His room has a shower too. With no tub. I remember seeing a towel on his shower floor that is either stained yellow or burnt. There is a very competitive vibe, like everyone at the house is in a battle.",
        "Snowy Steps. There are a few of us going down some snowy and slippery wooden steps. The snowy steps are outside and going down a hill, maybe to a lake or a lake lookout. There is a worker there telling people to go down carefully."
    ],
    "2024-01-17": [
        "Magic Dad on A Boat. I'm on a massive boat, there are a good number of people around. Nick or Ben or someone is on the boat as well. We have a father with powers or something and he is being hunted. The boat docks and nearly everyone gets off. I think I may have been sleeping, so I stayed on the massive cruise ship. My dad with magic powers either stays on or teleports back on the ship to me. Somehow I show up in an American neighborhood somewhere that is full of turkish people. As soon as I get there, a group of tiny fierce dogs approach me on the sidewalk. They are some sort of mix between chiwawa and Rottweiler. They are small. But mean looking, they bite at my pants leg, but I'm not afraid of them. I pick one of them up, but then put it down a little bit later. I keep walking through the little turkish neighborhood. I get to a small outside train station. People are there, and I hear one kid ask another how old they are."
    ],
    "2024-01-16": [
        "Computer Teacher Bus Driver. I'm in a foreign country. I find out about a casino and I go. After I play for a day or two I decide to go somewhere new. I board a bus and and sitting when I realize my bus driver is my computer teacher from highschool. He has 2 friends with him as well. We talk for awhile about my future and why I'm studying. In the next dream the same computer teacher has a classroom. I go visit him at the classroom and he gives me a book. He is watching a clip from spys in the sea, the discovery show about robot animals in the ocean. I give him information on the show. I leave and am getting on a bus with Hatice. The bus is 3 stories tall. When I board the bus I am made to go up while Hatice stays down for some reason. The bus is pretty cramped and I am annoyed that they workers didn't let Hatice come up and sit with me."
    ],
    "2024-01-15": [
        "Highschool Fastfood Job. I'm in highschool, I get a job fast-food place. It starts at 2pm. That's the same time school ends. The fast-food restaurant is just across the street from the school. The boss at the fast-food restaurant seems pretty intimidating. I'm at my last class of the day at school and a student says they have to go because it is 2pm. I didn't realize it was so late, I'm disappointed. I have to put on my fast-food work shirt. I hurry over to work, but get there late. I decide I will ask for later start times. I have some thought about starting later meaning that I will have to stay very late."
    ],
    "2024-01-14": [
        "Thailand Vacation Escape. Hatice and I are on vacation in Thailand. We discuss for a long time where to actually go in Thailand. We decide to be on the mainland first, then we will go to an island. We talk about getting a moped. I ask if Hatice can drive it without a license. We think Hatice can drive the moped. We make a friend that is a local to Thailand. One day he finds out that bad people are coming to get us. He tells us we have to leave immediately. We start packing up all of our stuff. We are packing so fast and messy. Things are not going nicely into our bags because we are rushing. The friend is getting nervous. We decide to leave before everything is packed and we say we will just hide the rest and come back for it."
    ],
    "2024-01-13": [
        "Joe Meetup. I stayed near a beach somewhere in a house. I get a message from Joe, he wants to come visit. It will be a bit of a drive for him. He sends his Google location. When I look at Google maps I notice his pin is always on top of 2 moving cars. So I know he got a ride from someone. He says he is going to cheese cake factory. I try to contact him and tell him my location but I can't get through. I have a drone, so I fly out and find their car. I see them park in the parking lot. The other guy has short hair and a white tank top. I arrive in person a little bot later with some friends. We are seated in the restaurant and then I go to find Joe. Joe and some friends are seated elsewhere. I pretend to do a magic trick where I describe the driver of the car Joe arrived in. We tell the very tall waiter that both of our groups want to sit together, bit the waiter says no. We are annoyed and so we all decide to leave without tipping. I felt a little bad, but I'm annoyed because we could have moved tables and sat together."
    ],
    "2024-01-12": [
        "Living Room Family Juggling Show. I'm with Hatice and her extended family. We are at the Driftwood Dr. House. I am asked, and pretty much told that i will do a juggling show for the kids. I cut my hand pretty bad. The back of my hand has a long cut on it from my wrist to my middle finger. I don't want to do the show. But word has spread and people are expecting it. I try to prepare ideas in my head. I decide to go with a food theme juggling show for the kids in the living room. I decide to start with balancing a straw with an olive on it on my nose. I'm not sure if there is no olives or what, so I improvise and I make a craft sculpture using scissors and the straw. At the beginning of the show a mother says she will leave to get vegan food and asks if I want any. I use one of the boys as my assistant. I ask him to find some tape for me. I realize there is already tape next to me so I tell him to throw imaginary tape to me instead of real tape so I can make it magically appear. I don't know why, but the little boy starts crying. The crying boy in the living room juggling show that i am performing makes me feel uncomfortable."
    ],
    "2024-01-11": [
        "Meh Juggling Show. I'm at a stage show that seems fairly professional. A group od performers that look like misfit ragamuffin go up on stage. It turns out they are jugglers, and I'm encouraged to go up. One of them starts juggling and they are not great, and they drop on their last throw. Everyone starts juggling on stage randomly, nobody is great. I try juggling 5 black and white balls,but I'm so out of practice. I drop the juggling balls a lot. Finally our time ends and we all get off stage. I go to a fancy restaurant with friends afterwards. The menu is edible, it gives a taste of what the things that can be ordered is. We are still looking at the menu when the restaurant closes. The waiter takes some of the menu, but I am able to keep some of it too."
    ],
    "2024-01-10": [
        "Icecapades. I'm on vacation with an Asian girlfriend. It isn't winter, but there is a mountain nearby with skiing. I go to the skiing place alone. It is steep, and the ski slope is very much just one specific route down the mountain. I go down the specific ski track down the mountain. I go up a ski ramp and do a back flip. After skiing I go back to the place my Asian girlfriend is waiting. We go to a party together. There are not many people there. The people are having an orgy at the party. I don't know if me and my girlfriend are involved in the orgy. My Asian girlfriend and I go walk through town to go back to the place we are staying. We see a cute homeless girl. We ask the cute homeless girl if she wants to come home with us. We sexually dominate the cute homeless girl. We tie the cute homeless girl up and mercilessly sexual tease her."
    ],
    "2024-01-07": [
        "Table Crayon Drawing. I am sat at the end of a table with hatice and Chelsea. The table we are sitting at is like a booth table. We are talking at the end of the table. Some other people start showing up. I think it is Chuck and his family. Maybe the other girl is Audrey, not Chelsea. The people who show up bring a piece of paper. I think the paper is a black and white flyer. They bring crayons with the paper. I start drawing blue on the paper. Then I draw green crayon under the blue. I add some brown crayon mountains to the green and blue crayon. Other people join in and start adding more colors to it. The crayon drawing starts to look kind of nice, almost like a painting."
    ],
    "2024-01-06": [
        "Family Reunion Cards. I'm at some sort of reunion. Sometimes it seems like nick and the kids, but sometimes it is different people. We are hanging out inside a house. I give presents to some of the kids. It gets to be time to sleep. There is a separate basement like at Chelsea's house. I want to go down there to sleep. I go down with a girl that is probably hatice. A weird guy comes down too, he hangs out for a while and we tell him we will sleep and he has to leave. He is disappointed by this and hangs out by the glass sliding doors after we lock them. Later Nick and Kaius will play magic, the card game. They show me special new cards that are animated by absorbing light on their back side. This reminds me of the playing cards I got kaius that I got kaius. They are playing cards that are stereograms."
    ],
    "2024-01-05": [
        "Speed Couples Retreat. I am at a retreat with a bunch of guys and girls about my age. It is a sort of speed dating retreat, but for 24 hour relationships. The host of the dating retreat is an old lady. On the first day we all draw names from a bucket. As more and more people get paired together I start to be concerned that I will end up with another guy. I don't know if it is possible for for guys to be paired with guys. In the end I get paired with Rachel. The only thing I remember us doing is sleeping together."
    ],
    "2024-01-04": [
        "Juggling Meetup Beanbag Search. I was at some place juggling. There were other jugglers there. There are lots of juggling beanbags on the ground. An old man is going around gathering up his beanbags. He seems to be unsure of which are his. I help him compare beanbags to figure out which are his."
    ],
    "2024-01-03": [
        "Band Without Dropping Juggler. I see a band I really like in a small venue. There is a song that is especially good and I want to hear it again. The song is about lesbians. I am able to find the band again in the same part of town a few days later. I tell the tall lead singer I like the song and want to hear it again. He tells me the name of it and I write it on a plastic wrapper. The ink isn't staying on the plastic so i write it on a napkin. He also tells me the address of their next show and I write that down too. I show up at the venue early when they are practicing. I mention I juggle with musicians. He says I cant juggle while they perform because I may drop. I do a few throws of a juggling pattern and drop right away. We talk for a long time about my different kind of LED juggling balls. I have lots of different kinds of juggling balls, some are pretty irregular. A couple have small things that move around on the outside of them and they seem annoying to juggle. I pull up some software I have made for handling color changes. My software has a timeline layout, but the software is not finished.",
        "Convicts Ceramic Sword Situation. Two prisoners have a brown paper bag. Inside the brown paper bag are two precious ceramic swords. Other prisoners break the ceramic swords in the brown paper bag. The prisoners swear vengeance. Months later, the guys who broke the ceramic swords are in a prison sword fighting class. Someone shows up and offers to spar with one of them. They agree and they begin to duel. At first they are fighting with fake swords. The stranger switches the fake swords with real ones with a magnificent flair. They expertly kill them during the knife fight. The old lady sword fighting teacher is annoyed that the swords got switched out for real ones. The murderer flees the sword fighting class. The murderer prisoner escapes off a balcony."
    ],
    "2024-01-02": [
        "Convenience store poker game. There is a short chubby foreign man working at his own convenience store. He has playing cards near the cash register on the counter. he has a deal where the customer pays for 2 cards and tries to get best hands with 5 card flop. You can pay more to get 2 more cards and a 2 more cards to make a 7 card flop. I go to do this up to a 9 card flop and he stops me and says this is just a training game, not something to be played all the time. He says people can play it once every 5 days.",
        "Post apocalypse world. Most people are dead. I'm on the run from bad guys, but I have some time. The bad guys are coming in a car on a dirt road. I move stuff in the way of the road. I am very strong, I'm able to move an old car into the road with my bare hands. In another place there is heavy machinery and a gang that has control of it."
    ],
    "2023-12-28": [
        "Ocean Circus Stage. Hatice and I are in Hawaii. We are at different places, but plan to meet up. She calls and tells me that she is going to do something with someone this evening. I am wondering around Hawaii jealous. I visit my tent in the Hawaii rainforest. Hatice tells me on the phone that she wants to meet up with me after she is done hanging out with some guy she meant. I don't want to meet up. I go to a beach and there are people there setting up for an event in the ocean. There is a stage in the water. There are about a dozen people in water around the floating stage as it is being set up. I get in the Hawaiin ocean water and join the crowd and i talk to a lady on the stage. She recognizes me and asks if I have ever been on the live version of Matt Walsh's improv for humans. I say I have long ago. She asks if I am still staying at nicks house on the island. I tell her nick and I both used to stay at Jason's house on the island. I say that this time I am moving around, sometimes I stay in my tent in the woods and sometimes at Jason's place. She says the show will start at 10:00pm tonight. I get out of the water and go talk to a guy about the show. It is a circus talent show competition. I have the idea to juggling glowing LED balls in the water. I ask if anyone juggles glowing LED balls for the ocean stage show. He says about 6 people usually do. I ask if people have waterproof LED juggling balls for this. My idea is to use my glowing LED juggling balls with bags over them. I remember the balls that you turn on and off with magnets. I tell him about them, there are no holes for water to get into and they are wireless charging. We keep talking, he tells me that there is basically 2 different groups that the performers come from. One group is led by a guy with a small psychedelic tent where people smoke weed and do mushrooms."
    ],
    "2023-12-25": [
        "Mr. Beast Park. I'm in a woods park with a small group of people ans Mr. Beast(the youtube star). Some people gather kindling for a fire. We start to build the fire. The fire starts to grow in our campfire. We build a small table out of forest sticks on the fire. The fire is only on top the campfire kindling table we built. I put my head under it to try to build a new fire underneath. I leave with Mr. Beast and his wife and young child. We get on small circle rafts in the ocean. He has bet someone that he could stay on the raft for days with just a few forgiveness. We ride out small circle rafts over massive stingrays in the ocean. We ride out small circle rafts over massive eels in the ocean. Mr. Beast falls odf his raft. I think he made a terrible bet, there is no way he can do this. I keep trying to clarify the rules of the bet because I think there's something I'm not understanding. In the end, he admits he made a bad bet."
    ],
    "2023-12-23": [
        "Yarn Lady Apartment. I got an apartment north of town. It felt like an abandoned apartment. It was very rundown. There is a couple living in another room in the same apartment. I am going home my first night and there is a lady there. The lady is made out of yarn. I talk to her by the front door. I go back to town to get something. I go back to the abandoned apartment. My roommates are there. I ask them in the abandoned apartment about the yarn lady. They know nothing about her. We start playing basketball in the living room of the abandoned apartment. The basketball hoop starts acting weird. Some impossible face appears in the basketball hoop. W freak out and leave the apartment. I forget my bag there and want to go back. They say I shouldn't."
    ],
    "2023-12-21": [
        "Cat Center. I'm with a friend at a cat place. It is like a cat safları, or a cat zoo. There are lots of cats, but sometimes they are hiding. We come across an indoor cat store. It is all about cats. The owner is there are we talk to him briefly. There are real time cat sounds being played over wall speakers in the store. There are microphones outside listening to cats. I mention that it would be cool if they made a vr cat suit that people could wear in a special room in the cat shop. Then have it hooked up to a cat robot outside where all the cats are. Then people could interact with cats as if they themself were a cat."
    ],
    "2023-12-18": [
        "Laptop Gone. I'm staying at nicks house, but it is different. Lots of the family is there, mom, dad, nick, Ben, me. We all go out one night, when we come home somebody notices the door was broken when we got home. Not much seems to be taken, some laptops are still there. I go upstairs. My laptop is missing. I regret not having my security camera program on. I try not to feel too bad about being gone."
    ],
    "2023-12-15": [
        "Nap Game. This was just a daytime nap. I know the dream was longer, but I forgot it. There was a game where the player comes into a room and then has to decide if they will cuddle with whoever is laying naked under a blanket. There was an old lady naked under the blanket. Because of this I lost the game. Then I watched from the other room as the next player came in to play."
    ],
    "2023-12-14": [
        "Green Convenience Store Bag. I was poor in a city. I went to a convenience store with a green bag and they gave me lots of coins. It was about 20 dollars worth."
    ],
    "2023-12-09": [
        "Bike Highway. I'm about high-school age. I'm biking in the middle of the highway with a girl. My bike is fast. It is dangerous to be biking here. I ride way ahead of the girl on her bike.",
        "McDonalds Line. There is a group of us on a bus. We all stop to get in line to get McDonalds. I decide I will get vegan nuggets. I start talking to a guy and they have a coupon. They say we can both use it. I write down that we want a nugget meal, one vegan and one regular. The coupon is a long narrow strip of paper. The guy covers the coupon in ketchup and mustard. He tells me not to let any vegans get ahold of the coupon. I tell him I am vegan. The McDonalds workers at the counter are very nice."
    ],
    "2023-12-08": [
        "Prison Horror Movie. I'm watching a movie with some friends. It is a horror prison movie. At the beginning, one inmate agrees to play tug-of-war with another inmate. They cheat and the other guy falls into a deep dark pit. That player gets taken away to a hospital or something. Now the suspense begins. We know that inmate will come back for revenge. Eventually they do come back. One inmate reaches through some bars and grabs the other inmates legs."
    ],
    "2023-12-07": [
        "Secret Asian Food Deliviery. I am delivering food in a big city like NYC. I get a delivery to an apartment building to a cute Asian girl. We start talking in her kitchen. I am impressing her in her kitchen with my little bit of Japanese. She starts teaching me a little bit of Japanese in her kitchen. I dance with the Asian girl in her kitchen. The Asian girl and i make out in her kitchen. I feel bad for cheating. We exchange numbers and make plans to meet up again. I got back to her apartment building to have dinner with her and a couple friends. Me and two girls are crammed into a tiny elevator. We can not even stand all the way up because the ceiling in the elevator is so low. It is very dark in the cramped elevator for the three of us. There is something strange like a green color theme on a computer. I am wearing green and it matches the Asian girls green apartment. I tell the other girls that I am kind of dating the Asian girl, but it is a secret."
    ],
    "2023-12-06": [
        "Spanish Hardware. I'm Hanging out with nick and Ben and Daulton. I mention to Ben that Spain is one of the best countries ever. Next thing I know I am in Spain with nick and Ben. Ben is loving Spain. We go to a casino. I give Ben some poker advice. He seems serious about following the advice because he wants a way to make money so he can stay in spain. I have a special player's card. We leave the casino and go outside of the casino. There is an outdoor nightclub on a grassy area, it looks cool, but is empty. We watch a video on someone's phone. In the video on someone's phone, somebody is showing how tall their building is be showing their view make s a huge tower look tiny. We leave the casino area and start walking through town. As we are walking through the city we see a little girl yelling for her mother. We continue walking through town. We get to a hardware store. I remember being at this hardware store before. I am barefoot in the parking lot of the hardware store. There are small square sheets of plastic lined on the ground for use to step on. Someone is taking pictures as we walk down them. My barefoot are sticking to the small square pieces of paper. I ask if I should put my shoes on. A lady says I should and I should disinfect my feet first. I say I will was them too. There is a bench next to a hose and an open loading area in the back of the parking lot. The water run down a slight sloping the parking lot to a drain on the ground."
    ],
    "2023-12-05": [
        "Carnival Destruction. I'm with mom and dad in a front yard. An acquaintance carnival owner comes over. They have a huge truck loaded with massive carnival equipment. They construct a huge tower ride where a couple people sit in a capsule and freefall and almost hit the ground. The free falling carnival ride capsule serves at the last instant to avoid the ground. Me and mom do the free fall carnival capsule rude together. The carnival guy and dad leaves. Mom wants to move the tower ride a little bit. When we do, it falls. The massive tower crushes the man's large truck. We are standing the yard looking at the massive tower ride that crushed the large truck. I ask mom if she wants to lie about it and she says no. When the carnival man comes back and sees it, he is very sad. He says something that makes it seem like he forged an insurance signature or something. When I ask if he forged something, he says no. At the very end mom is quite sad. She says that up until it fell she thought this whole experience had changed her life for the better."
    ],
    "2023-12-04": [
        "Nicks Aquarium. I am at nicks house. We are looking at his aquarium. His coral has gotten big and has flowers growing from it. I start explaining about the aquarium  and what's happening with authority, but I doubt myself at first. After a little while I remember about coral spawning and I explain that. Male and female both send out egg and sperm at the same time. They meet up quickly,  but they need to get away from the coral so they drift out to sea. Eventually they are almost ready to root so they start listening for their parent reef and they had back to get ready to root."
    ],
    "2023-12-03": [
        "Family Razors. I'm with the family at the ranch house. We are all hanging out, getting ready to go on a trip. We are packing. I plug in my yellow and black electric razor. Dad has the same razor, but he doesn't have the charger so he thinks he can't use it. I check and find out that any usb-c cord will work."
    ],
    "2023-12-01": [
        "Coffeeshop Tech Meetup. I'm in a very nice, new modern, tech focused city. There is going to be some sort of tech presentation happening at a coffeeshop later. I go over there early and hang out. There are two floors, an upstairs and downstairs. I sit at a table upstairs. I leave and go to another coffeeshop to pass some time before it starts. I'm on my computer at a table at the other coffee shop. A girl asks me if the other one has lots of seating, I say that it does. I lose track of time, and then have to rush to gather my stuff. The coffeeshop has put lots of flyers on the table for me to take."
    ],
    "2023-11-29": [
        "Boom Mic Crowds. I'm in a 2nd world country. There are lots of crowds in the street. Many people have large boom mics being held over certain crowds, it is to be able to hear certain conversations. I leave my orange and black netted bag on a city bench. I talk to someone in the bustling bohemian city street. I get back to the bench and my bag is gone, there is a teenage sitting on the bench. I notice someone else with a bag like mine when I'm looking for mine. The teenager shows me that he put my orange and black bag under the bench. I go to a rental apartment with Hatice. There is a very plain kitchen. The fridge is to the left of a cupboard. The cupboard is empty except for some cans of beans. Hatice wants to leave, she is annoyed that I'm being slow. I'm making sure everything is turned off and locked. There is a round silver lock on the front door. Hatice is waiting in the car while I try to use the silver apartment door lock."
    ],
    "2023-11-28": [
        "Blue Shirt Show. I'm wearing a blue shirt and am on a college campus for a special event. I am wearing a blue shirt on stage, there are lots of people wearing all white on stage with me. I wonder around on stage in a blue shirt amongst other people wearing white. Gradually they all leave the stage until just I am left. I go walk around outside around the campus, I'm wearing a blue shirt."
    ],
    "2023-11-27": [
        "Public Toilet. I am sitting on a toilet in a room with a few other people. It is an awkward situation, i am embarrassed. There is no toilet paper. I have to wipe my ass with my bare hand. There is a sink next to the toilet.",
        "Pencil Plane. I'm on small commercial plane. I see a sky view of the plane landing on a small, long Island that is pretty much just a runway surrounded by water. I have lots of bundles of pencils around my airplane seat stuffed in weird places. While sitting in my airplane seat I pee into a bundle of pencils the plane lands on the long and narrow runway island."
    ],
    "2023-11-26": [
        "Gym Room Dressing. I am at a fancy high-class gym changing room. I am preparing for a date there. After I finish preparing for my date, I go to the woman's changing room. Chelsea is helping Hatice prepare for the date. Chelsea is doing Hatice's hair. Hatice leaves to go get dressed. I am talking to Chelsea in the fancy woman's gym changing room. Hatice comes back and she is wearing a beautiful yellow dress. I am complimenting Hatice about it in the woman's gym changing room."
    ],
    "2023-11-25": [
        "Avocado War. I'm in an Army that is going through and destroying enemy territory. I am  eating food left by the enemy army. We get to a place that has lots of avocados. There are locals from the land there but we don't kill them, we are only after soldiers.",
        "Pirate Grandma. I am somewhere and I know mom is there with grandma. They know I am sort of around, but didn't know I was right at the same place as them. I watch them from a distance. Mom sees me. I ask how they are. She says not good. Grandma had pirated music and her music player is refusing to give her the music back now. It is like a public use boombox. I say that I think I can get it back, but it may be tough. I think we can get a print screen of all her music and then male an AI that torrents it all. Before I do that i see a girl my age that works here and has special abilities. She says that she can make a new player as well as free all her music from being ruined.",
        "Performative Pooping and Pizza. I go to a movie theater, I'm early, but there is a coffee shop. I have my own private coffee shop room with just a single table. There is a toilet behind a divider wall in the private coffee shop room. After awhile I go to use the toilet to poop. As soon as I'm about to poop, someone comes to use the bathroom. They look through the window on the door and see me about to poop. They leave and come right back and look at me again through the window. It is awkward. After I'm done at the coffee shop, I go to a show that uncle Allen is doing on a stage. I go up on stage as his volunteer. He has me hold a circle tray on the stage. He throws some food onto the tray I am holding. Then he throws a pizza onto the tray I am holding. The pizza is a puppet he has control of from across the stage. I see the pizza hanging from strings. He does a comedy routine where the pizza is almost sliding off of the tray. The pizza is dancing on the tray I am holding."
    ],
    "2023-11-24": [
        "Hooker Hotel. I get a hotel in a foreign land. It is a room at a brothel. After I arrive, I immediately leave and I go to a massage place. It is a cheap massage place, everyone is in the same large room getting massages. The masseuses are giving handjobs and blowjobs. I leave the building. I buy a snack. I go sit in park to eat the snack. Finally I go back to my brothel hotel. I start talking to the worker at the brothel. They introduce me to girl and guy prostitutes and are expecting me to choose. I hang out in the brothel lobby for a long time trying to decide if I will sleep with one. I'm hanging out for a very long time with the prostitutes. Finally, I leave and go downstairs to my small hotel room in the brothel. The layout of the hotel is strange, there is a prostitute in my apartment with her own room."
    ],
    "2023-11-23": [
        "Poll Coat Rack. I'm playing pool with Dan and Ben. It gets down to the last few balls, I go to take my shot and the back of my stick is hitting a coat rack. I move the coat rack, but it is still hitting it. I have to move it a few times before I can get a good shot. Finally I take my shot and I scratch."
    ],
    "2023-11-21": [
        "Upper Garage Door. I'm at the Bird Drive house with dad. We bought it again. There is a garage door on the top floor of the house, it is over the back yard. The garage door is stuck and won't open. We want to come up with a way to open it. We have a small crane. Dad thinks we can get the crane all the way upstairs. I think we should use a pulley system to get the door unstuck.",
        "Food Line. I am somewhere with lots of kids lined up to get food. After them, adults line up for food. I get in line early, but then realize it isn't vegan. I am covered in a black body paint latex, even my mouth is covered"
    ],
    "2023-11-20": [
        "Conference Encounter I am at a conference. I stay late until there are just three of us left, me, a woman my age, and the elderly woman presenter. We go to a really nice large house. We all three sleep on the same bed. We begin to have a really awkward threesome. I feel like only the elderly woman actually enjoys it.",
        "Cathode. It is really vague, but it's about electrodes and cathode and anodes."
    ],
    "2023-11-19": [
        "Game Mouse Park. I'm at a place where parents drop off their kids and we watch them. It is very free, outdoors, big grass area with ponds and bridges. Some kids hang out on their own or in groups. There are a group of us that go off to play a board game(Secret Hitler). After awhile I leave the game to walk around some. There are lots of rats free to roam here, they are like pets. I walk around watching rat moms with their kids. I see one mom with her kid and she has a different rat in her mouth that I think she is trying to eat. It get free from her and I pick it up and throw it at a rock. I don't know why, I guess I wanted to help her be able to eat it. I immediately feel guilty and hope nobody saw what I did. I notice one of the boys we were playing the board game with. His brother is around too. His dad is walking toward us. I try to gesture to the kid to see if he wants to play more board game(Secret Hitler). His dad is coming back from disliking and is quite dirty. His dad says they are going home now."
    ],
    "2023-11-18": [
        "Son Art. There's a mother who comes home after a long time. A son who has made pictures at some sort of communal museum. The pictures are spins on or remakes of popular cartoons, the pictures require batteries, maybe for lights. There is a kid in the neighborhood who has repeatedly taking batteries from the family without asking. A bow and arrow battle ensues between the mom and son and the thief. The mom and son wins. Then explains kindly why he can't be stealing all of their batteries."
    ],
    "2023-11-17": [
        "3D Tanning Printer. Hanging out with nick, dad, a couple other people. Some sitting on bed, some standing, someone building something on the floor. We are talking about light 3d printer machines. I mention a tanning bed 3D printer could be made to give a tan image."
    ],
    "2023-11-16": [
        "Spinning Lighthouse. I am in an old leaning lighthouse with a glass floor. It seems very unsafe, but it is a tourist attraction. There are more people in here, and I can see many more climbing a latter up to get in. I am in the front, more people are coming over here to see. I'm freaked out a bit, I don't know how this is legal. As I work my way to the middle it starts to spin, I'm feeling sick, I close me eyes, I go to the back side and put my head down. Beverly calls. She is pregnant, I congratulate her."
    ],
    "2023-11-15": [
        "Train Worker. I get a job working for a train/metro company. I get in the train one day to go work. I have a jacket on and im carrying another one. The train is for train workers only. A couple with a small child gets on and I get up for them. I almost miss my stop, nyc, so I hurry off the train. I forgot my jackets! The lady notices and holds them up, but it's too late, the doors are closed and the train starts moving. I start looking for a worker. As I'm looking, a small child falls from above onto some tracks, they seem ok, some people start helping the child. I get on a train going north to the next and last stop. It is a prison."
    ],
    "2023-11-13": [
        "Mud Pit Podcast. I'm hanging out in a city kind of like I'm homeless, but I'm not really. I have some place to stay. I do however find a large hard to get to muddy pond that is locked up behind a wall in a courtyard kinda place. There is electricity and a radio there. I drain the pond and dig it all out very deep and refill it to have a deeper pond. Later on I go back to it and listen to a comedian podcast while I run more water into it. It gets late and I leave to go home. I realize after I go that I forgot to turn off the water and the radio. When I try to go back I keep missing my entrance door, I guess I'm distracted. Finally I'm getting in and I come across a guy who kind of seems to be in charge of homeless community, he asks a couple people if they are living in the courtyard, they say no. He asks me and I say no, but I was just listening to a podcast in there and i was gonna turn it off. He says OK."
    ],
    "2023-11-12": [
        "Multi-floor Card Game. I'm at a place with many floors and elevators and escalator and there are tons of us playing a game. A very official game with referees. I almost feel like we have to play. Like we are in school or jail. The rules just seem to be that in order to leave this place you need to match all your cards, maybe just by color. The game tells everyone where there are cards remaining, but if you run out of the ability to win then you are out of the game. For some reason I have gotten too relaxed by the end of the game. I needed this last card and I wasn't even on my way to it. When I realized I started sprinting. I pass a player on the steps on the way, then I see the top of the steps. There is a woman almost all the way there, a very fat lady. I go up the steps as fast as I can. I kind of pull on her. Then I let go and apologize. She gets the last card, but she can't use it. I get it. I can use it because I have a wild card. Now I have a red and a wild and a few brown cards. There is a final brown cards/s in an elevator, I'll get more cards if I get the other brown.",
        "Ryan Hangout. Hatice and I move to a new city. We make some friends through a group of people, the guy is a ryan gosling. He is dating a beautiful woman. The 4 of us hang out for awhile in their apartment. It is kind of boring, hatice leaves and I say I'll be home soon. After she leaves ryan starts doing one armed pull-ups, he is very strong. I joke about them not being very good and we start to wrestle. I am mostly winning. I mention it and he just stands up and easily breaks out of my holds. I am humbled. He leaves and I lay on the couch. I'm kind of sleepy. His gf comes over and puts a sheet on me and holds my wrist. She says she loves me. I am super uncomfortable. I tell her she doesn't, that we barely know each other, we've only met twice. She holds my hand and I pull away. I go home, hatice is there with friends, I have a bag of adult supplies that I got from the couples house. I show them, we laugh. Hatice and I know we will use them."
    ],
    "2023-11-10": [
        "Future Self Sacrifice. Some kind of future world. I'm with an acquatence. Another one shows up and we are going to go somewhere. The second one is supposed to inflict the first one with deadly poison because they broke the rules. There is a chance that the issue gets fixed before they die, but at this point it seems so unlikely. We go somewhere to run an errand. Those two have to wear masks when they are on the motorcycles, the poisoner has a mask with eyes visible, the poisoned has to cover their whole face. We go to a building with ramps and receptions inside. We have our scooters with us. We run our errand, but the person is still going to die. After our errand we will go to the place where the one will die. Before we go there, it is revealed that the poisoned actually decide to take the poison them self in order to help the other. It is the ultimate sacrifice. We are trying very hard to get the antidote. We go some place with a large pit, there are lots of white birds flying into it. I don't think we do what we need to in time."
    ],
    "2023-11-09": [
        "Real Time Dalle with Hatice. Hatice and I are in bed, each on our computers. I notice there is a new chatgpt thing. It is dalle that updates in real time as you type anything."
    ],
    "2023-11-08": [
        "Slime planet. I'm am astronaut. We go to a foreign planet, we know there is something weird going on here. When we get there it seems empty of anything like animal life. We end up finding this black slime. The slime can slowly spread. If you touch it, it doesn't matter if you wipe it off, it is like you are infected now, it keeps coming back on you and eventually it kills you. Even knowing this, for some reason I decide to touch it anyways, maybe I think it will motivate me to figure out a cure.",
        "Poker Accusation. I'm travelling, doing deliveries, I just recently had a delivery for a ups package, but I don't work for them. I stop at a casino to play cards. It goes good for awhile. I never really take a huge stack, but my stack just steady grows. Eventually I go to leave and the guy to my left says I took some of his Chips. I insist that I haven't taken any, and I say we should call the floor, and they can check the cameras. Security and the pit boss comes, they mention I'm not from the area, they ask why I'm here. I tell them I do delivery work. They tell me to wait. They ask if I have ever expelled a demon. I say maybe, but if so then long ago when I believed in demons. Most players leave, I wait around and talk. Finally the security comes back, they give 21 of my chips to someone at the other end of the table, and they give me 4 from the guy that accused me. I apologize for the 21 guy, and ask how it happened, they try to explain, but I don't understand."
    ],
    "2023-11-07": [
        "Rooftop Peaople. There are a bunch of people on the roofs of buildings. They can do whatever they want to. Everyone is in paradise, but someone gets hurt in a strangle way, and some people are suspicious, they start planning payback and forming plans. Everything stays fine for awhile. But then be overdubs and humans are also protected. The storyline stays up here, but mstɓh. (I don't know what this ending was supposed to be)",
        "Infralight Event. I'm at some place or event near nicks house. There is a girl there that tells me and nick and someone else that she is going to take us to nicks house around 3pm. That's a few hours away. I hang out in a big gym area. She comes by at some point with a large wheeled infrared light, i stand in it for awhile and then leave. I go to sit with a guy and find out that it is 3:30, I go back and start talking to her. She starts to say something and I laugh, but I'm not sure if I understood her. She seem to pick up on this and she says a few more illegible things as if expecting me to laugh, but I don't because I don't understand. She asks if I have a car, I say im not sure, I left one at nicks awhile ago, but I don't know if it's still there. There is a high cupboard/storage loft, she taps it to scare rats before opening it."
    ],
    "2023-11-06": [
        "Firing Toilet. I'm at a place, nicks old cleaning girl Is working there as a desk job. Somehow I notice there is a sports player that she really likes. I think it was Emmitt Smith. We talk about him for awhile. I tell her who I liked as a kid. She gets official word that says she can't work there anymore. She leaves and comes back and someone uses the toilet and it pretty much backed all the way up, but doesn't spill over. Other people show up and everyone can see this gross full brown toilet. Someone apologizes that it's so full, and I say no, i'm the one who is sorry."
    ],
    "2023-11-05": [
        "Bad guys lie. I am with mom and some other family. There is something that mom wants me to do, but I don't want to. Nydia is also around and I make a deal with mom, she needs to tell nydia something for me, but it is implied that she needs to do it privately. Mom doesn't get this and just starts telling everyone that she is going to do this. I don't remember the specifics, but I am quite annoyed, the whole point was that she was supposed to just casually tell nydia. Separately, dad points out that there are these two creepy foreign, German I think, guys talking about taking a kid. Later on, I happen to come across these guys in a park watching a kid from a distance. I go up to them and tell them that they are so fucked. I lie to them, and tell them that earlier i recorded them talking about taking a kid and now they stalking one in a park. They kind of freak out and run away. They go tell a friend or two and one of their friends comes over to me and we wrestle while he tries to take my phone from me."
    ],
    "2023-11-04": [
        "Restaurant Champion. I go back to visit erie. There is a restaurant that I used to go to a lot and I am on the front of the building as the current trivia champion. I go in with my backpack, but i go into a private room and nobody sees me enter. I talk to someone in there, and mention that it says I am the current trivia champion and that I have a long streak, like a month, but I'm pretty sure I've not been here that whole time. When trivia starts, I try to do it it involves going around the restaurant pushing the right number of buttons. I figure that if I win I'll tell people I'm there, but if not then I'll keep it a secret so that nobody thinks to take down the poster saying that I am the current winner. I do very bad, so I stay in hiding. One of the other private rooms has someone eating in it, but also that's where I store some of my stuff and I want to grab some stuff. When they leave, I sneak in there and I open my backpack and take stuff out to rearrange. It is a very cluttered room, and it is dark. I am concerned that I will forget to put some of my stuff back. It gets very late, 5am, and I think ll the workers went home, I'm concerned that the building will have an alarm and I won't be able to get out. I notice that I can hear a worker still and I see a car pull up to the drive-through, I can tell it's a friend of the worker that is still here, and they are going to get them food. So I think this means that I'll be able to sneak out."
    ],
    "2023-11-03": [
        "Elon University Mascots. We are at a place that is like an Elon university. He had remote control animals there for people to fly. It is messed up, they are not dead, but they have to do whatever the remote control makes them do. Some people are flying them into water on purpose to put them out of their misery. There are 3 buildings on campus, 2 nice normal ones, and then elon has his own that is like a super nice huge garrage. That's where he is in charge."
    ],
    "2023-11-02": [
        "Circus Fly. I'm watching a stage performance. There is a main performer and I think my friend or someone is on it on a normal height unicycle. After my friend leaves stage, a massive unicycle comes out, like 30 feet, almost the the ceiling. It is wheeled out by stage crew. Then snoop dog, or some famous performer runs out and does a leaping mount onto the unicycle. He quickly gets up, does tricks, lays down the uni while staying on it, gets it to go back up, and then starts zooming around like a fly. The main actor is now on their belly on the floor, and they are doing a parallel thing where the main actors is trying to catch a tiny fruit fly, and the man on the unicycle represents the fruitful. They have a tiny version of the stage background. Maybe after the show I'm walking around town on my way somewhere and I walk by a pub or something and the smoke coming out is so gross and painful.",
        "Casual Fly. I'm at a huge open mic at the harborcreek home. I realize that i'm able to fly, sort of. I can kind of lay in the air and do the worm and it keeps me up. I know this is unexpected, but it seems totally plausible and i remember thinking i could bet people in real life and win bets by doing this. So There is a middle aged lady running the open mic. I'm not really paying attention to the performers, but I am drawing, fairly poorly, but I'm super into it and enjoying it, it's something I've not done in a long time. An older guy sees me drawing and says he used to draw and was good. He leaves for awhile and comes back and shows someone a picture he just drew. I barely see it, but from what i see, it's incredible, it is a closeup of a face, and he says he got the detail by using lots of different media's. The person he shows it to says that can't believe it's not a photo. There are supposed to be a foreign soccer team returning to the house from a match. Their match was canceled due to horrible weather and now quite a few players are sick when they arrive."
    ],
    "2023-11-01": [
        "Trip to Israel. Somehow I've gotten onto Israel illegally though Palestine. The World is different. It is as if Israel is the peak of a mountain and Palestine is the base. I feel like I'm in danger and want to go home. I won't be able to go the normal way though, so I think I have to go through Palestine or something like that. I try talking to some people about how to do this. I end up finding some people in the same situation and we figure there is strength in numbers. We find a way where we should be able to go,  but we need to narrate our way out by reading from this paper. I end up as the reader. It is too tough for me and so I decide I will try my luck just walking back to get help for us. The trouble is, it isn't marked when I get to dangerous areas. I get to a tunnel and I start walking through. I see a Palestinian kid at the other end of the tunnel. I get nervous and don't go through. Nearby I see a group of Palestinian and Jews fighting through a fence. I talk to the Jews about crossing Palestine to get home and they say it's not possible. I'm off to the distance talking to some important Israelis while watching in the fence fight. i notice someone has a grenade on the Palestinian side of the fence. I tell the important people and a more intense fight breaks out",
        "Video Games and Pull-ups. I am with savage, a girl I sort of recognize, and maybe Dalton. We have a bit of a club house. We are playing a game like smash bros except the level is super tall and scrolling. I think it's not a great game.r our character are out of view a lot. Later on we have an Asian friend over and he is sending a box. He needs to write his email address on it, and he asks one of us to help. Savage writes the first part, but does it so big without realizing there is more. I try to find a way to write the long part after the @. Savage does some pull ups and when he is done he is annoyed that we didn't all watch him do them. He asks if anyone saw and the girls says she did, and he asks why she didn't tell everyone that he was doing them. We all agree that it isn't a big deal and he is annoyed. Now I'm on stage with a middle-aged important Japanese lady. We are sat at a table. Mainly I'm doing nothing, just sitting while she presents something. Then she says something to me, it is hard to hear and I feel uncomfortable."
    ],
    "2023-10-31": [
        "I go to place to work with or lot of chimpanzees and I have a long checklist of things to identify on this animal, like \"is it a vocal learner\". The list is long and black and white."
    ],
    "2023-10-29": [
        "Life Costing Shoelaces. I'm in the lobby of a theater when I, along with some others are delivered some packaged shoelaces from an australian car insurance company. The packaging says something about \"cost you your life when you slip\", at first I think it means something about the insurance company giving free insurance, and slip has to do with a car slipping, but then I realize that has to do with keeping you from tripping. I remember going in to one of the doors on the back rightist side of the theater."
    ],
    "2023-10-28": [
        "Waterproof Paper. all I remember is something about waterproof paper",
        "Rushed Van Pickup. I purchased a cheap van and I am driving to go pick it up, not really paying attention. There are cops with blue and yellow lights parked in the middle of the 3 lane highway ahead stopping traffic. I slam on the breaks and veer left to an exit ramp avoid them. I manage to stop in time."
    ],
    "2023-10-27": [
        "Bored War. I'm in a war. It is not very involved, it is basically just that we stand somewhere in a group of 2 or 3 of us and we send bullets over near the bad guys that spread out into a bad fire. Sometimes it gets their soldiers, sometimes it doesn't. The other side is doing the same to us. I notice that their fire stuff never seems to get me. I think it's just because wee have good tech, but it also feels like I'm good at war. As we go place to place we are watching videos of other humans doing this and I an thankful.",
        "Homeless Embarrassment. I'm homeless in nyc, walking through parks and such. Finally , I decide I will go for a swim to clean off. I want to put on my bathing suit before I head to the beach, so I go behind a building, I decide I will be super fast, take off my underwear, then try to quickly put on the swim shorts. They are so tight, it is slow  the parking lot is on a huge hill, people see me, I can see them pointing, I am really hoping no. Cop drives by. Finally I get them on."
    ],
    "2023-10-26": [
        "Barely Battery. This was almost nothing, but I remember looking at my phone and seeing that my battery was low which didn't make sense because it had charged all night, so it must have been a dream."
    ],
    "2023-10-25": [
        "Alien Artship. I am an alien. I meet an alien of a different race and we start hanging out. In this world it is not illegal for two different races of alien to hang out, but it is a little strange and it is very illegal to date. We hang out all the time and we text, there is evidence of our relationship in text. Sometimes I go over to her moms house. We need to be careful at her moms house because her mom is, in general, very strict. If we were to get caught, i would be the one to get in trouble. We are going on a walk along a river one day. This river has lots of buildings around it, and lots of amazing graffiti and artwork. We see a piece that looks amazing, the artist is there working on it. I go a ways away to get a good angle of it to take a picture. Before I can take a picture of it, I notice that the artist has put it away. I assumed it would always be available to see, I didn't realize it could be put away. I was 5 layers, the first layer was the statue of liberty holding up one arm, each layer after that was a hand holding up 2 fingers, than 3, than 4, and then 5. When they were all lined up right it just looked like a 5 finger hand. One night we are at her mother's house. Her mom is making dinner. She works at a unique restaurant and invites me over to come see it. She works at a restaurant with an anthropomorphized rabbit theme. She shows me pictures. There are rabbit dolls all over the place, on shelves, and even on the floor. I feel nervous and don't want to be this situation, so I say I would love to go, but I'm so tired. I am concerned about our relationship, and I'm worried that if we break up then shemight show others our texts. I decide that I need to get her phone and delete our texts."
    ],
    "2023-10-24": [
        "RoboChair. chair that has robot legs. fell back asleep to get that since I remember nothing when I woke up first time."
    ],
    "2023-10-23": [
        "War Princess. I am in a war, we have a captive woman, like an asian princess. There are not many people around, just me and another guy. We are in messed up dirty building. He decides he will take advantage. I determine to help her. I semi free her and provide a weapon. She is able to kill him, but now we much need to get out of here and maybe hide his body to buy time. I think we decide to fofnoþn44(umm.. what is this??)"
    ],
    "2023-10-22": [
        "Forgetful meal. Walking around taking pictures with Hatice. There is an Alice in wonderland monument background. There is a place she poses with a large lit up Christmas tree. A guy is at a restaurant with his gf. For some reason he goes to the front counter while they are still eating. He decides to pay since he is up there, but he forgets which meals they ordered, so he goes back to ask there is a chocolate and cream dish that she is saying he ordered, and so he should know, he felt like she had basically made him order it because she didn't want to admit it was what she wanted. She is a little annoyed because  Then he goes again to pay.  The next day I am at the guy and gf's house and he tells me this story: after he went home from the restaurant yesterday, he had a confrontation with a bad guy. It turns out that he owned a gun and it somehow got him out of the situation. Maybe he shot the bad guy or maybe just shot near him.. He has about 12 friends over and goes to the backyard with them. I am talking to the gf and I mention how lucky they are that he had a gun, but she is clueless about this happening. After awhile I forget he has friends over. I go out back and they are playing a volleyball variation with no net and free movement. I join even though I don't really know the teams or how to play. The song Baby Got Back Is playing."
    ],
    "2023-10-21": [
        "AI Future Forest. In future ai takesover for specific communication and humans develop communication that all other humans instantly understand because it is strictly tonal. Ai begins picking Mates for people. It becomes illegal to do communication that ai can't have easy access to, no handwriting or going places outside of ai's hearing reach. It could turn out that animals with the simplest communication that all other animals understand are actually the animals that had the best foresight of the coming ai communication assistant."
    ],
    "2023-10-20": [
        "Wanka Cosplay. Savage and i go to see a small theater performance of willy wanka. They want the audience to dress up as characters and they ask savage to be willy. He gets bored part way through and doesn't want to wear his hat. The show doesn't make much money.",
        "Japanese Metro Spaz. I am with a group of Japanese guys and we are ridding the subway. I think we all have tickets, but when we try to leave the metro worker stops us. The don't seem to even be trying our cards, just saying they are not working. The worker is super spazzy and jamming buttons. I tell a cop I think they are having a seizure.",
        "Og Street Performer. I see Lidya, she is performing at a metro, doing amazing plate spinning. Later on we talk a little bit. I ask her where the best place she has found to street perform is. She says Og because it is near where several pilgrimages begin, so lots of people come through there when just beginning their hikes and they have their own money. Someone comments that they think street performers can't make much money, but i tell them that they would be surprised."
    ],
    "2023-10-19": [
        "Super Good Colombian Monster. I'm at some sort of club, meeting thing. We are discussing something and then we get on the topic of an upcoming event. The leader wants to know who can attend. The first person says they have to ask their wife, a few people say they will probably come I think, then another person says they have to ask their wife. When it gets to me, I say I have to ask my wife, but then I immediately feel bad because I lied, I have no wife. I consider correcting myself but don't. After me this fat little kid says something about how his mom dropped him off from Colombia when he was very young. It is awkward and sad. I ask him if he ever wants to go, he says \"yes, every second of every day\". He is very sad about this and starts eating like crazy. I try telling him that he can channel this sadness into being a super good monster."
    ],
    "2023-10-18": [
        "Pay nick. I go to visit nick and he has weed suckers for me. He also has a bill for them for me to pay for. Mom has a bill as well for something else, and the bills are together.",
        "Erie boats. I take hatice to the Erie house. It has changed a lot. Something like a home owners association has put together a free floating dock station there. At first she doesn't want to leave the house, but then I convince her to go out because we can see pretty much h the whole family out there enjoying it. We walk around on a floating dock, a small boat comes near us and someone throws me someone's purse while they get off on a boat and onto a dock. I jokingly go to walk away with it. We see mom and we talk briefly about how it used to just be a small like wood workshop down here on the lake, now it is so developed."
    ],
    "2023-10-17": [
        "Flying Wealth and Poverty Mountain. I am at a place where the higher you go, the less well off is the country you are in. Iraq was very high. Generally when people go high, they risk jumping off because they don't actually fall as fast as it seems like they would, and of they succeed then they can stay in the country they jumped down to. Mom and the grand kids and Bethany are visiting me in this strange world. I've gotten used to jumping down a few countries so I show mom and them around. It is a rush jumping because we can sort of jump like we want and float down.",
        "Pokemon Puzzle. I am with nick and I am on need of a shirt. My shirts are on a public building where we were staying together, along with his wife or gf. I go to get a shirt from the suitcase and I notice that all my clothes are gone, as well as my black shoulder bag with my cash and IDs. I discover my stuff nearby at the place where there is usually a homeless man. It seems odd that my stuff is there, I think maybe it was nicks gf that wanted my stuff away from hers. My orange t-shirt is here, but it is long sleeve in this dream.. I gather my stuff and go back to nick. He is playing a new version of Pokémon. I join. The characters in this Pokémon are female. It is different than other Pokémon. It is a mix between street fighter and super Mario bros, it's like super smash bros. and while doing hand to hand combat, there are Pokémon fighting in in the peripheral. I tell nick while we are playing about what happened to my stuff and ask if it was his gf wanting my stuff away from theirs. He doubts it. She comes by eventually and she is surprised."
    ],
    "2023-10-16": [
        "Unexpected Snow Tour. Hatice and I sign up to do a tour. A van picks us up and starts driving us. At first we are awake. We are sitting on either side of the aisle. Eventually I fall asleep and when I wake up, there is lots of snow on the ground and it is snowing hard. Hatice is asleep. We were not at all expecting snow and we are not prepared. I notice another woman on the bus has boots, so other people did know what to expect. I consider waking Hatice so she can think about what we can do about this and can see the snow, but I let her sleep. We drive out of the snow eventually, but I can see snow in the distance below us, there are hills around and the snow is only at the bottoms of the hills. A middle aged man moves to sit next to Hatice and she wakes up and switches seats and falls asleep again. We stop in a parking lot and I am able to just stand on the ice and slide down the hill."
    ],
    "2023-10-15": [
        "Uphill adventure. There are a few of us on our way somewhere. We need to go uphill through a city. I think nick has a stroller with kids in it. Someone else has a bicycle. I am in front and I have nothing. I am walking on the sidewalk but it gets so steep that I have to go into the grass and dig my fingers into the dirt to be able to continue up the hill. I am alone at this point, I've no idea how the other 2 will make it up  eventually it gets too steep even to climb on grass and dirt so I make my way over to the now vertical sidewalk and I pull roots out of the sidewalk cracks and I begin climbing them like hanging vines. I am worried that they may break so I am trying to double them.",
        "Cookie bones. Mom is there and acting strange. Savage is there. She says she went to a doctor and learned there is something rare about her bones and after she was told this, Oreo showed up and offered her lots of money when she died for her bones. Caleb shows up and I repeat the stuff mom said and this makes her uncomfortable and she leaves.",
        "Dariush convention. I'm at something like a rainbow juggling convention. It is nice there, one day people are yelling and a bunch of people come through riding buffalo's and even tractors using rope to steer in a way that they can't see what's in front if them. They are going so fast and dangerous. I try to avoid them some but run down the hill. At some time I have some chocolate and I offer it to Dariush and he rejects. I asked why some and we talked and he ended up having a little bit. I ask why it's unhealthy. He said but I guess it was just chemicals he didn't remember when we played poker on his birthday."
    ],
    "2023-10-14": [
        "Star Surprise. There is a big event, I feel like the guest of honor. I have plans of a place to stay. But lots of people want me to stay around them. I get an offer to stay st a house that is part of a group of expensive boat houses. I get surprised with a huge fee.",
        "Schoolkids Last Day. I'm working at a school program with kids. I am some sort of assistant. One of the main teacher women are leaving. It is really sad, she will leave all her kids. She cries and so do i for her. for some reason it becomes OK for kids to go home early and for me too.  I help a kid, seems like my nephew or something get a metro ticket so they can go hoke early as well. To get to and from the place to buy metro tickets there is a sketchy ladder to a platform we must do. He does it very naturally. I'm about to leave, but then decide to stay at the school and read some of my book. At some point I Show dad and nick a special part of vscode that executes code immediately and tell him that it is also for coding in vr,  but ive bo idea how its related."
    ],
    "2023-10-13": [
        "Apartment Experience. I answer an ad to go look at an apartment. It is in a basement. It will be shared,  but I get my own room and a shared rec room. When I go to check it out, the other guy living there is not home. I have a place with family nearby but I need space sometimes. I agree to rent it. I come back later and my flatmate is there. He seems kind of nice, but he isn't thrilled about sharing it. He is the son of the people renting it. He pays rent. He tells me I can use the house sometimes, but not always. Later on we are at college, first day I think. A girl comes up and the three of us are talking. Turns out they both like the same kind movies  and they both like to bowl blindfolded. I try to get them to both go do something, but she refuses. Me and the guy realize that someone is watching something at his house today and we have a projector and a huge speaker and we can hook then up. We go home to do that. We get distracted by trying to flip coins high up onto a bookshelf.",
        "Snack To Convention. Hatice and I are on our way to a juggling convention, but we need to get food first. We have no car and so for some reason we ask someone with a car who is going to take our phones. We manage to make it to a store, they have Doritos and a chicken restaurant. We buy Doritos and ask if the restaurant has vegan food. They say no. A customer tells us that when they came long ago they were stuck eating Doritos as well."
    ],
    "2023-10-12": [
        "Little Anger. I am going for a boat ride or something, I'm not sure what, but people are lined up to go into a building. There is a very short Israeli guy that is not happy about me going. He follows me around outside the building for me to break a rule or something I guess. He doesn't carry why I cant go, just really hopes that I cant go. For some reason I woke up with my watch in My hand. He has weapons but nothing is good enough to actually leave."
    ],
    "2023-10-11": [
        "Puzzling Washer. I'm out travelling, someone else is in my group, but its not hatice and its not savage. Savage is travelling in the same place as me though, we are staying in the same apartment building hotel. I figure out how to pretty much use the communal washing machine, but my clothes are still slightly damp. I notice savage is using the room service to have his clothes cleaned. I ask him why, and he says nobody could figure out the washer. I tell him I can do it, but it has a problem While I'm showing him. I notice hatice is gone and I get sad and wake up.",
        "Hometown Hacky Scam. In a small town that is like a combination of northeast and harborcreek. Some people that remind me of childhood are there, but only one real person, Becky. I walk around a lot, usually alone. I buy 6 hack sacks full of weed seeds for a pretty high price. Later on i see Becky, we've not talked in a very long time, I saw hello. And make sure she is Becky by asking her. She indicates to her Long goatee and says he name is Greg now. I walk around more, eventually I stop buy the store that greg works in, and look at a paper on the desk and I leave. Later I go see some friends, they are messing around, someone is trying to break a window. A kid falls off a table. I run into someone who has my beanbags. They were expensive. We are talking about how much I can sell them for. One is open, it is full of shiny rocks, not seeds. Something stinks. We open more, each has a different worthless thing in it, I got ripped off."
    ],
    "2023-10-10": [
        "Face Mold. I am working on some sort of project, and am having an issue. I am with a flamboyant friend and they suggest that a solution would be to have a mold taken of my face. We go to a place and they are about to close, but they agree to quickly do it. They fill a large barrel full of a black liquid. I am concerned that it is latex and will make my psoriasis bad. I'm debating in my head and I say I don't know if I want to do it. Since it is set up, my friend decides to do it. He puts his face in, some of his long brown hair goes in as well he takes his face out and the black stuff instantly hardens and they peel it off. I make a comment about how well it came off of his face."
    ],
    "2023-10-09": [
        "Interactive Zoo. I am at something like a dangerous interactive zoo. I mention something dismissive of their fiercest snake. So, they set the snake after me. I get chased around by it. It seems to be in as good chase,  it it is scary and dangerous. (Animal species survivor would be a good vr game, maybe even one where you are a predator animal)"
    ],
    "2023-10-08": [
        "Misunderstood Entertainment. I'm watching an old black and white movie with savage. A few times we pause to look something up about the movie. We have a few realizations a few times about how things are happening that are strange because they are mirrors of Christians misunderstandings of the original Christian teachings where some things get over represented. For instance, there are grapes everywhere and it shows how important their grape juice is to them, but they ignore the parts about being stewards of the land. There is other stuff about being superstitious, like people cant get out of their house for some reason."
    ],
    "2023-10-07": [
        "Jumbled Delicacies. I have hatice or someone like her over to grammas house. The dream is pretty chopped up into fragments. There are some vending machines that are hooked up to a system of room rentals and i get blocked from the vending machine for having sex in a room rental. This happens to a guy working at a store as well. I have a family reunion and Doug Wilson is there. He is squeezing oranges onto a table and locking it off with a dog."
    ],
    "2023-10-06": [
        "Family Business. There is a big extended family. All kinda living together near the harborcreek. There were sort of ruled by a mother. She had a main son and a father that were kind of 2nd in commands. Her son had lots of kids. I went looking one day kind of frantic and saying I need to find her father. I thought something went wrong, so I needed to know he was a fine. The main woman told me where to find him. She also mentioned money was low and asked if I could help out. I say I'll think about it. I end up deciding i will give 40 euros layer. I find the son he has lots of children. I hang with the kids little bit. I tell him i'm going on a long trip. He wonders if I could teach at their homeschooling at some point. I say probably. He asks if I want to buy some weed they grew. I agree. He puts the weed in a huge bag with some sand dirt. He friend tells him that a bad idea because it makes the week worse. I find the mom and give her the 40 euro, and ask how i can order food. She gives me a delivery sheet and says another woman wants cheese fries, but I don't want to order non vegan, so I just don't order. I finally go to leave the group and I see the son, he is outside organizing the group into color by the shirt they wear. He is tired of life I think.",
        "Weed Pros. I go to a place where there are some guys my age that grow weed. They're friends of a friend or something. I ask when the difference between indica and saliva are. The most knowledgeable says that the female makes a sort of list for the male and than the male brings the attributes that the female wants. That list made by the female is what determines what kind of weed it is. We start talking about chatgpt. I ask if anyone has seen gpt vision, they haven't, so I give some examples of it. Then I tell them about gpt voice and finally the internet access. I think go on to explain phind to them and how to use gpt4 for free."
    ],
    "2023-10-05": [
        "Uncomfortable Massage. Hatice and I go to a massage place. They tell us the room to go get undressed, separately, then where to go to get the massage. Hatice finishes before me and goes to meet the masseuses. I think she couldn't decide between the two girls so they are doing it randomly with their names on cards. I walk in, and awkwardly, sat nothing when I arrive. The host and both masseuses are there, and and someone mentions my silence. After it is selected who gets who. We are supposed to go put our valuables in a locker. The locker doesn't lock and I am surprised/annoyed. This annoys the host. I feel bad. But I can't relax with my valuables just sitting out. I bring them with us. Now, it cuts to hatice and I being about to watch a show. Before the show, there is a funny guy making jokes, talking about chimpanzees. The show starts, It is performed by hotel staff or something it seems. Hatice comments that everyone in this country have incredible skills. It is acrobatics, starts out normalish, at some point someone is spinning soup ladles, but then it starts incorporating a couple very amputated people, people that are practically only heads and a couple limbs.",
        "Nicks Other Mom. I go to visit nick(sometimes he's daulton), he is a teacher. I meet his students. He had a separate mom from me and he has recently killed her. It seemed very justified. I go to his school. Tell his students about circus school. We go to get sushi, but i dont eat fish."
    ],
    "2023-10-04": [
        "Dolphin Marathon. I am somewhere in Africa, there is a marathon race and I sign up and start running. I am going good at first, but I want to listen to something other than music and my phone battery is dying. While I'm running, I manage to get a hold of someone to get me something else to listen to. I switch devices out on a counter in a the race. Sometimes I have to run with no audio. The race is going good, more than half way through. I get and make the choice to put dolphins in the route ahead. I do, but some get killed by sharks as babies. Some dolphins get bigger, but I see sharks trying to eat them, so I try to beat up the sharks using the dolphin as clubs sort of underwater. I feel bad. It kind of works, sometimes dolphins get bit.",
        "Bad Good Father. I am staying with a family, they have a father and two young daughters, there is another adult male around, not sure how they are related. I get some methamphetamine somehow, i don't know how, but i do know that in that context it is pretty unusual for me to get it. i do a line of it, but I don't remember feeling different from it really. I am talking to the dad and I mention that I have some cocaine, he is surprised, but interested, and asks if I am serious and i say no, but I really do have some methamphetamine. He wants to do it, and so we go put a line on a little table. He does it in front of the daughters, and so does the other guy."
    ],
    "2023-10-03": [
        "Fancy Farm Dinner. A restaurant gives a trip to a farm and they give a shot of strong liquor while waiting for your food.",
        "Cliff House Whale Tale. I'm staying at an apartment and to get to it, you need to climb this ladder. The ladder itself moves, and you can move it while climbing. The ladder goes down to a shore I think. They have used this exact ladder in several different movies. Savage comes over one day to see my new place. We are in the car going to my new place, and talking, and I am explaining about the ladder. The conversation shifts to the new whale birthing. I tell him that for the first time, people have witnessed a sperm whale being born. I tell him that the sperm whale needs air and so all the other sperm whales hold it up out of the water. Dolphins show up to witness the event. Pilot whales show up as well. Pilot whales sometimes attack sperm whales. The pilots charge, over and over, but never actually go all the way to attacking the sperm whales."
    ],
    "2023-10-02": [
        "Love Dungeon. I am in a strange hospital/hotel/prison/entertainment kind of place(but we seem to be free to leave). Older men and women are doing some sort of Sexual experiment on a younger woman, it seems like maybe it is for my entertainment. In general, the place has a very erotic vibe. Hatice shows up and they put us on adjacent hospital beds, we are pretty out in the open, it is a large room with lots of beds like ours, but most are empty. We have curtains on tracks around us that we can pull shut if we want to. We are laying there on our own beds talking about religion. I bring up the point that I can't believe that God would make all my family, aunts, uncles, cousins, parents, everybody be born into the wrong religion. And I ask her what percent of people does she think endup in a religion that they were not born into."
    ],
    "2023-10-01": [
        "Magic Exception. I go to a magic shop with a friend and as we get there, people are leaving. We try to go in and the owner, guy from hangover, tall, the owner, says he is closing. We beg to go in for a few minutes to get something fast. I saw I just want a set of a couple cards and I tell him I know how to do the muscle pass with cards. This impresses him and he let's us in. I say I use to have a special small set and he gets a small set with invisible string. My friend has not seen invisible string before. I explain that it is hard to work with. For some reason I consider if mom will be able to use it or not.",
        "Hotel Intruders. This last dream ends and I'm in a hotel room with Hatice. We are getting ready or something and someone comes in. A woman, she has a towel. We talk for a sec and she leaves. It was weird. Before we can lock the door, she walks in again, says nothing, and walks across the room and gets her forgotten towel and leaves. I motion to Hatice to lock the door and before she can, another woman walks in and asks why the first woman keeps walking in.",
        "Ankitown. A city that is sort of set up as an interactive Anki school somehow. It sort of feels free, but sort of like a school. I remember being impressed by the place, however also stressed out when some public anki machine wouldn't work, or when I couldn't figure out how to use it or something.",
        "Billie Concert Friends. I am working some place with little furry cute monkeys. I take 2 babies and an adult away with me and go to a Billie Eilish concert in Miami and take selfies with them there. I try to get Billie Eilish or her name in the background of the selfies, but it is hard, not sure if I do it. It is hard to handle all 3 monkeys there. For the most part they ride on me, but sometimes they get down. Billie comes out and announces that snoop dog is in the audience. I leave early because the monkeys are hard to deal with. As we are leaving, a baby monkey gets caught in some hanging chain links at the exit, it sort of hooks through her nose. I release her. We finally get back to the monkey place, we ride a truck there, I think I sort of hitchhiked. There is a fire as we get close and they are putting it out by using a crane to drop burning stuff into the water. It seems fake to me because the fire goes out before it touches the water. The truck I rode Is collapsable and I watch them collapse it automatically. I can't find my phone so I frantically mime to them that my phone is i the collapsing truck. Then I find It in my pocket."
    ],
    "2023-09-30": [
        "Nick's livingroom battle. I'm at nick's place, but its unfamiliar, ian comes over. I am happy, I want them to meet. Nick is out, but savage and a couple others are there. Ian puts a USB into nicks private laptop. I ask why, I'm suspicious. He won't say, i take it, and we start yelling. Turns out he was hacking, maybe just for fun, but still. I make him leave. I tell others whey he is angry and leaving. Nicks kids custody paper has a signiture from his ex, but it gets ruined, and now the paper needs to be refulled out and signed. I sign her name, it isnt like her signiture, but we erase it and nick plans to do it. Bad guys show up, but I don't remember why. Im shot in the head, bleeding, I manage to grab one of the bad ladies and smash her head until it is gone and until she is dead. She can't hurt me now. A big big guy is after me though, and he isn't shot."
    ],
    "2023-09-29": [
        "Itchy Spider Bus. I'm on a bus with hatice, and her girl friend and that friends friend. We are going somewhere and at some point the friends start itching and they say that they have a very contagious itching spider that goes from person to person.",
        "Embarrassed Foreigner. I'm with hatice and a guy friend that she has from school. They are working on a project. I am making some, sometimes silly, suggestions to hagice it turkish. Then I realize that they are also speaking turkish together, so the friend also has possible understood me all along.",
        "Vehicular Clown Purchases. I'm in japan, I make a friend that has got a huge flat-front truck and they will live in it while driving around with weed in it. I start thinking about doing that myself. I tell them and they offer to sell it for 25m jpy / 4k usd. Later I befriend some local clowns. One of them gets a lawnmower and is mowing lawns to make extra cash. One day I decide that may be a good way to make money and shortly after that I see them.when I finally go to talk to them, I run into the older woman clown that started the clown character that they both play. We discuss the possibility of me buying the clown persona and the lawnmower."
    ],
    "2023-09-26": [
        "Distracted Stabber. Nick and I go to the house of 2 brothers in the country, one is disheveled, big lumbering, long hair, dirty. We miss our last bus back home, kind of just by deciding to stay longer because we are uncomfortable about leaving, they seem lonely and maybe dangerous. At some point there is joking about the big one stabbing us. I think maybe we can call for a ride from someone online and then I'd I perform and prolonged drawn out couple of tricks then maybe we can survive and the quickly leave. They have some toys bit they are too floppy for me to actually balance on my face so I keep trying and failing. The car doesn't respond. I hide 2 knives under some magazines but the big guy eventually finds them. Finally a chase starts, his eyes look crazy as she chases me. He seems childlike sweet. I wake up while he is chasing me with the knife.",
        "Busan Chang's. In Busan, sk. Not sure where I want to go, so I decide to go to Pfchang because I want to always have the memory and story of having had gone to one that was actually in Asia so whenever I go to one in the future. Someone is with me, I think it's nick, I am navigator using my phone, we take a metro, I am navigator. We get a stop or two away and I can't breath through my nose so I start looking through my bag for a tissue. When I look up there is someone pointing a gun at me, they are a cop or security, they smile when they see its just a tissue. I have a hard time blowing my nose. Finally we get to our stop, it is an area of town with tons of dungeons and dragons figurines."
    ],
    "2023-09-25": [
        "Busted Power Cord. I had a power cord and it had a broken prong.",
        "Pantless Belt. I had a belt and needed pants so i went to thrift shop. I showed the shop worker my belt and told them it was mine. I asked if they had more and they told me where. I also asked about pants and they told me where they were.",
        "Ejected Gym Student. I was in some sort of gym class and have to leave part way through temporarily and the teacher came and asked for my shorts for someone else to use so they could join the class. I was annoyed, but gave them and then left the class.",
        "Future Retro Gaming. I'm at a gaming place with mom and and brother, the world is mainly is like a videogame, like vr, but I remember no headset. We get lockers for stuff, mine is on a different floor. The game itself is a low graphics running jumping shooting game. Running is shown by big circular legs blurs without any real movement. Mom and brother get stuff from their locker but I need to get back to mine and remember my locker code. They have a small box of coin rolls. Each level is basically the same, just harder and different animation pics."
    ],
    "2023-09-24": [
        "Specialized Food Court. I'm at an Asian restaurant with a cafeteria food court, it is unusual because the different restaurants each make their own part of the meal, such as a meat one, a sauce one, a sides one.",
        "Weird Meat Travellers. Rode the bus with two friends trying to find our hotel. In the bus showing some strangers some magic tricks, but i didn't know many. They were only somewhat impressed. The muscle pass didn't really work well since I'm out of practice and my callous is gone. We were not sure which stop to use, but we got off eventually. While walking through a mall with a stranger who was helping us find our hotel I saw a sick or wounded dog on a blanket and I thought it was a veterinarian in the mall. Then I noticed large raw meat near the dog and realized they were killing dogs for food."
    ],
    "2023-09-23": [
        "Rejected Escalator. one day I go to use an escalator to some high touristy thing and the lady doesn't let me, I don't remember why, but she let's people use it even if they have luggage because she has lockers for their stuff. the next day I can't use it because I am not allowed to use lockers for my stuff."
    ],
    "2023-09-22": [
        "Crossing to Meaty Coffee. I'm in a field there is a Hindu guy working on a path across the muddy stream to leave the field. The first time I want to go he is very helpful, stops what he is doing, and clears a way for me. The next time when I want to leave with nick he is less helpful. We talk for a long time and he says i cant go across his bridge this time. Nick is already on his bridge, so he walks across. I try to go across the same way but the bridge bends and my foot gets very muddy. I end up running and jumping across. Nick and I go to Starbucks and there is meat everywhere. We decide to go somewhere else. We go to a place where nick buys a large box of coffee that comes with a bag of raw meat and a bag of raw dough in the box. One worker is surprised that the other one uses a bag of raw dough. I go to another place, alone, to get a large hot black coffee for someone and an ice latte or something for myself. The worker barely fill mine, and they can't figure out how to get hot coffee without burning themself because the coffee dispenser needs pushed up at the nozzle. I suggest using chopsticks and it works. They try to charge me 9$ for both coffees even though mine is almost empty, I complain and they say I have to do trivia or some contest to get mine full. I do whatever I needed to, and end up getting both coffees."
    ],
    "2023-09-21": [
        "Don't Write So Much. a girl telling a guy who is on his computer to not write so much",
        "Soccer Camp. juggling soccer resort camp, with dorms, i got switched to a dorm with 3 bunk beds i thought, but maybe i was confused and actually was just sent that information to be able to go there to buy something. i hitched a ride out once to a little shop to explore a little and look for a cold coffee drink, but didnt find one",
        "Resort Squared. A square resort island we kind of get to see some sunset. There are trays of food set up outside in public areas if you stay at the good resort."
    ],
    "2023-09-20": [
        "Insulted Juggler. uri insulted someone at a juggling festival, he punches guy in head it makes a crater. cop come and treat him horribly. beat him and make him carry heavy stuff.",
        "Juggling Reunion. i run into mike from highschool at an ejc and i tell him i hang out with some of the best jugglers. He is fairly new to juggling and there with a friend."
    ],
    "2023-09-19": [
        "Garage Campers. 9 of us live in our vehicles on a garage together, i struggle to put my van in the right place. Some vans are missing",
        "Busted Zipper. One zipper pull thing comes off of jacket, manual shows instructions to put it back on on page 607 with a warbler and I ask neighbor bc he has the tool."
    ],
    "2023-09-18": [
        "Druggy Dreamer. im with some people, we do some sort of drug or something and i black out and have a dream and we do some sort of crazy something and later on i tell them about the dream i was having while we were doing whatever we did.",
        "Bad Students. im with some sort of school group, and we have a reutation for being bad. one day an army of soldiers come to have a sort of intervention for us. there is a presentation happening and a lady worker/teacher comes to survey me about my badness and asks questions like do i do drugs at least 1/3 of the days. a student comes over and asks if there is someone or something i want to hold, and i say yes."
    ],
    "2023-09-17": [
        "Andy's Scam. in a store with andy and someone else, trying to do something with socks. andy goes up some stwp/ladder to get sock and intentionally slips and slices his hand in front of manager to sue the store.",
        "Savage's Box. met sav in nyc, hatch plan to go to ac. decide to maybe get a prepaid box to send stuff on to nyc once he rqils. show him the sleepinfg path on nexr island",
        "Liquid Courage. liquid courage and people with large physical brains"
    ],
    "2023-09-15": [
        "Raging Roommate Ramsey. I was with gordon ramsey, i was dating someone living in his apartment, he wasnt especially nice. I was walking out of his apartment one day without a shirt on when he was walking in his his son, they both were shirtless as well.",
        "Water Rappers. I was part of a rapping crew. There were 2 rappers that didn't know each other. The guy I was with was more cool and collected, but intense. He was white, kinda built and tall. The other guy was so nervous, he kept saying he over focused. We met at the studio. Someone had soda water from a machine. We were waiting at bar seating in the middle of the room. Waiting for a big time producer. I imagined myself freestyle rapping."
    ],
    "2023-09-14": [
        "Patient Kim. Kim Kardashian with doctor behind her",
        "Smoking Group. Group smoking on city street, one hitter and a bowl",
        "Maid 'n Man. Maid cleaning room with man in bed",
        "Action Photo Boat. riding around in a boat taking action shots of crazy waves out window, this is after taking pics of islands and such outside the windows."
    ],
    "2023-09-13": [
        "None."
    ],
    "2023-09-12": [
        "Weed Dream Chaser. I knew I was dreaming and thinking that since he really wanted the dream, if I could keep him chasing the weed then I could stay in the dream",
        "Deaf Jealousy. I'm living in a snowy place and there is a deaf girl there. She is jealous of something, and she rigs up my headphones to make me go deaf. She gets caught, my ear bleeds, i can still hear out the right eye a little. Ir. Good thing is, now I can buy expensive subtitle glasses that can translate any language. No idea how to give data in new language in conversation."
    ],
    "2023-09-11": [
        "None."
    ],
    "2023-09-10": [
        "None."
    ],
    "2023-09-09": [
        "None."
    ],
    "2023-09-08": [
        "None."
    ],
    "2023-09-07": [
        "None."
    ],
    "2020-05-29": [
        "Alright, so there's on this make-peer and there's these other people. And I'm like kind of working with them. They have this box of maggot-like things. I don't know like they explain to me or show me or something that the maggot things have some kind of like super powers or like special powers or super intelligent or something. And I get into a feud with these people. I end up getting my own maggot plays. They're maggots like locomotive, mine aren't. They explain to me that things are going to get really bad if our maggots meet each other because of the different kinds. They explain to me that things are going to get really bad if our maggots meet each other. They explain to me that things are going to get really bad if our maggots meet each other.",
        "Oh my, alright so somewhere with Nick and Audrey, this little little house, we get a delivery. It is a very diverse collection of really large feed needs or dolls, like life size. I don't have any, I don't have any, there are two, just the address, which I call that one to give an important address for the delivery. And the dolls were manic answered for medical equipment. Okay so the moment comes and feel like he says something that I think is a hint that he wants a tip because there's like 12 of these things. So I think I'll get one of those guys moving on the trip. One guy who took an extra trip. And so then I get some cash and when he gets back, I can say, oh you're the tip. I drop the cash. And so I pick up some vibes and ones, they have a dorm and he has me back in the money, but I don't know if he needs a fight. And he says hi to you. And then he says something about not running in the, he says something about, and then he says something about not running in the money. And then he says something about not running in the money. And then he says something about not running in the money. you"
    ],
    "2020-05-19": [
        "Alright, so I'm at this place. It's like a camp. There's different rituals that they do. I feel like a ritual is that you're supposed to do when you're alone. The one that I'm doing in the dream is like... I don't know, it's like making lights happen in the distance or something. You do it by my accent. I don't know, it's like calling it a foreign and then putting your head up fast or I'm not really sure. I think it's like a joke. It starts to put me into a headspace where then if I want to do something else, I can't. Alright, between a headspace where I have less control over my body with my conscious mind. And then at one point towards the end, the lights turn into faces and they float around some. And at that point I really heard it control. Alright. Alright."
    ],
    "2020-05-11": [
        "Alright, so I'm in Mexico. I... I keep it in a train and for some reason I have like a bunch of boxes and crates to me. I thought they were garbage at first but then I like... I could not sit in a train and I was like carrying anymore. I was sure I got them but maybe I stole them. And so at this time I'm gonna like throw them away and I start throwing away but it turns away. It's like old VHS and Nintendo games and I don't know if it's other stuff. So I threw away the garbage but then I started stacking the solar stove next to the garbage. It went like right after I exit the train in the train station"
    ],
    "2020-05-04": [
        "Alright, so I was with Nick and Audrey and they were playing a game and I had some baking soda. And as you're Nick or I mentioned again, you play with it, I thought it was a super common game. And then Audrey and I were going to play it when they were done. And Nick was going to explain how to play. And Audrey was like, oh no, let TJ explain. And so I thought about it for a second. I was like, don't do any jacks to play this. And Nick I laughed and said no. And so then I was like, oh yeah, that would be jacks. And so then I was trying to think of how to play this game. And so then I tried to think of how to play it. And then I forgot the name of the game. And then I asked Nick what the name of the game was. And then my computer in real life slipped off the angle it was on and woke me up. And then I was like, oh my god, I'm so sorry."
    ],
    "2020-05-05": [
        "I just had a very small one. I was at a park with Audrey and some other girl or friend of Audrey's. They were already there and then I get there and talk to them a little bit. Audrey says something like, oh, you're doing a smoke and indicates that her friend was packing a pipe. Audrey had just smoked. She's acting a little stoned. Her friend hands me a grinder and a pipe, I think. I fill it up and then I give it back to her. She's about to hit it and then this lady walks over and talks to the girl over the... She's leaning on and says she can't smoke. The girl says, okay, we're at a park because we'll play around and everything. She does seem scudgy. The lady is still standing there. The girl is like, is there a bathroom nearby? We're smoking a bathroom. The lady doesn't seem to like this because then she takes the pipe from the girl. I think I hear it says she's going to the cops but I don't know. Our apartment is right there, my apartment that I'm sharing with. I think it's Skylar. Right there in the park. The girl is leaning on the wall and then just like facing her, it was Audrey and I leaning on our apartment. We go in there. We have some familiar first room but the second room is really similar to my current apartment here. I go in my stuff away, Skylar's in there. I see a hay. So that's her room. Oh."
    ],
    "2020-04-29": [
        "So I was in some kind of like, I don't know, it's like a, good. Like a drama, Spanish soap opera. Um, but it wasn't like a real soap opera. It was like, I was in a reality where everybody was acting like they were in a soap opera. Um"
    ],
    "2020-04-26": [
        "Um... I... ...beary... ...with savageness girl that... ...like I guess I'm like kind of dating maybe? And we go to mom and dad... ...and... ...and we go to mom and dad... ...and we go to mom and dad... I don't know if we even went to mom and dad... ...or no... ...no... I go to like walk to girl... ...around the front of the house or something to get some alone time... ...and we go to the front yard with her and we start making out... ...and... ...and I don't know like I realize at some point that... ...mom and dad are eating... ...and we're like right through the window and you're seeing us... ...so we continue on walking a little bit... ...and then... ...we just have to go down the lake... ...the girl's a little dainty and so... ...we decide to see if we can use the pool's house... ...like we use their steps... ...because we think that we better than ours or something... ...so I tell them like we don't have to go all the way down... ...but we can like go in part of the way you know... ...and so we get out part of the way... ...and... ...we... ...like pass some people going down... ...and then once we get down part of the way... ...there's a clearing down there... ...and Mr. and Mrs. Pooa there... ...so we talk to them and they tell us that you know you could get on further... ...you could get a little sketchy with a good off further... ...so we get a little further in the lake... ...just a massive waterfall... ...and it goes through the... ...like really close to the steps kind of... ...the steps kind of peter off... ...and... ...and we're like okay this part as far as we can go... ...so the side we're going to get is on direction a little bit... ...and I hang out with the girl and the south comes back and they say hey... ...now I'm going to go like explore this way and see what I see... ...so I do that... ...and... ...I find a way where we can continue on a bit... ...and so I continue on that way so... ...and then I get to the place where there's like a road... ...and there's these people down there... ...and I'm like when the world's going on like... ...this doesn't look at all familiar... ...and I've been down here for a couple of years or whatever... ...and like... ...it's still like all familiar... ...and I'm just like mind blown... ...and I'm like why are there people down here road? ...and so I go back and I get savage in the carol... ...and I'm like you guys gotta see this... ...and I don't understand what's going on... ...and I'm just like... ...mind blown... ...so I'm gonna get them and I bring them more... ...and I'm like... ...and I'm like let's go explore around and stuff... ...and start exploring and it's a whole... ...hippy town... ...it's like a permanent feeling rainbow gathering... ...and so... ...weird seguas are around... ...and I... ...you see all this cool stuff... ...there's some kind of a market... ...it wasn't there for any monies involved... ...they have into fruits and vegetables I imagine... ...um... ...so you know... ...we were going to talk about this guy who has like... ...he has some... ...some food or something... ...but he also has a fire... ...but not just done a fire shot cool... ...and so we asked him when nobody had his actual fire... ...since all the hot cools... ...and he said well if you wanna have a fire... ...you have to pass the test... ...and he said what test... ...he said I'm like here I'll show you... ...and so... ...he has a scraping hot cool... ...and he like turns it over and keeps his hand on it... ...and says something twice really fast... ...and he has it there... ...and it's like that's a test that you have to be able to do... ...with order to have a fire... ...and so... ...and I was like savage trying to... ...but... ...not much success... ...and so... ...and so..."
    ],
    "2020-04-24": [
        "I was hanging up with that and he asked if I... He mentioned an email that we talked about before that he'd sent me and it was a video from a juggle magazine and he'd written up something with it but the weather he wrote up with it I never got, I did get the link so I watched some of the videos he sent me it was like a juggling show or something like that festival, we were wearing lots of green and running around somehow by watching the video I ended up at the place I watched a little bit of the show and I left."
    ],
    "2020-04-20": [
        "Alright, so I was testing testing. Okay, so I was on a boat. It was like a ferry. I think it was in New York or some other big sea. I met some street kids. I didn't want to know that I was not a street kid. There was elements of the boat. It was a really big boat. It was almost like a church on it. It had a big open area like a park because specific park is here kind of. And there's a small group of kids. I feel like they were at all just recently kind of met each other. There was at least one girl and one guy. Maybe there was two girls. I think the one girl kind of liked me. I was kind of making it seem like she did. I think I was even really clear that they got along. We other people. We were somewhere and one of the girls was missing. Somebody said that she just got arrested. But I couldn't really nail down like why. Somebody said it was because she lied or something. I don't know. And earlier on there was this church place. I had been there before for something. I went back again. I went to use the bathroom. There was people sitting at a table. There was something on the screen where they had the screen. The screen said chocolate chai. I don't think we have any chocolate chai. But I had a packet of it in my bag. When I came out I was like, look I have a chocolate chai. I gave it to this guy. He's like a 400 or something. I'm not really paying attention. He just took the food and he ate the powder. And I was like, well dude, that would be a lot better if you put in some hot water. And he could realize that or something. He started trying to eat this powder. Later on towards the end. I'm waiting to get off of this boat. And these other chemistry kids comes over. They sit close to me. They would be in a little obnoxious. But then they dump out some juice or something. And they start running down the floor of the boat. They see something like, oh look we're feeding her. They make sure there's somebody on the ground and their juice is getting over to them. But then they realize there's some cops around. They go, shit look there's cops. And so I wander away from them and go to the place. They go to the place where we get off the boat at. And there are a couple of few cops there. When I get over there they start walking over towards this homeless kid. The homeless kid's realizing they still walk in the direction. But the other direction they walk is also towards some cops. And then there's some other riders on the boat that really don't like these kids or something. And they're trying to tell the cops where they are and to arrest them. And then they start walking. And then they start walking. And then they start walking. And then they start walking. And then they start walking."
    ],
    "2020-04-18": [
        "Alright, so I leave out of here on a walk. Kind of with a plan to get a bike. But I think I go for a day or two. I'm back really heavy. I have a lot of stuff. I'm like wearing a bag and carrying a bag of my arms. I find a thrift shop that's open and I think maybe they have a bike, but they don't have a bike. I think I have to wait a day to get a bike. But I'm in like a really beautiful place. And I think I get some good pictures. I realize that being able to draw quickly would be good for being able to pull images out of dreams. It almost feels like I'm in a foreign land, a foreign country. I go to a place where there's like a bowl of water bikes or something and I can't go people on a tiny little boat. This is your shop, it is the last thing to happen."
    ],
    "2020-04-16": [
        "I go to a juggling engine in New York. I am friends with the people running it. I mean running it is like a super rich magician. I know in real life that I don't remember. He is actually a super rich in real life. He is Tom Conner's. He is like a private airplane pilot in New York and we get there kind of early. He says, hey let's go for a plane ride. He has a plane pilot there. We make it into Miami really fast. When we get to Miami, his pilot is doing all kinds of stunts and stuff. He finds super close to buildings way closer than you can. He says he wants stuff like chops a tree and half. There is like a squirrel like chewing on a tree and chops it in half. He says he wants to go to a tree where it is chewing. He needs some other stunts. He is in the land. He wants to go to a tree where it is chewing. He needs some other stunts. He has a lot of ants. He has some duffel bag. He just dropped off. He has a briefcase and he just dropped off. We are talking and we are going to Miami. He says I am going to Miami. I came to New York and we went to Miami this morning. I said I can't get a Viana. He said I will not get it anymore. I was looking forward to the convention. I was really bummed because I really good at convention. I said my driver is in the second flight back to the convention. I said it is going to be almost midnight by the time we get back. He said I don't want to take that long. I am still disappointed that I won't be able to go to the convention. I am going to Miami. I am going to Miami. I am going to Miami. I am going to Miami"
    ],
    "2020-04-14": [
        "So, met the apartment. And you see the group of squirrels and they were making a walk just pets upside. One of them, like, sticks his arm to crack a window. Behind the window, they could find these things, something else like that. And"
    ],
    "2020-04-12": [
        "It was that a juggling convention early and they started like taking down tables to set them up. I think they were like leaning on their side and I helped set one up a smaller one that was like just for me. But I think they said maybe they were going to use it but they weren't sure."
    ],
    "2020-04-04": [
        "I look for a... I think I remember both, you know, thing... um... maybe in management, maybe a parent's fronted... um... um... um... and you do get the doctor some day because I keep on like, projectile vomiting but I feel fine, just like, happen occasionally. So, it tells me that it's probably lupus, maybe it's sepsis, um... and one day I can pass out and I wake up and there's a plague going on on the boat and the breeze tied up. um... uh, before the plague, I am having issues. um... and I was going to the hospital because I was like, to scrap on night and my thing is until two o'clock and now it's like, 10 o'clock or something and a little tired so I don't know if I should try to sleep a little bit or if I should just not bother going. So I look up, I tried to do some research on lupus, sepsis, to see if I think I have it. um... um... you"
    ],
    "2020-04-02": [
        "I had a brief one where I went out for a walk on a bike to a castation and they were only using the nighttime window but it was on nighttime just because of the virus and so I used that to get I think with some water I think I want to bubble water."
    ],
    "2020-03-28": [
        "I was with my dad and dad went to go on a kayak trip. So we went to a big sports store. He had to kayak, we didn't inform him. First we picked out some other stuff. There's a few necessities. There's a small paddle and helmet."
    ],
    "2020-03-22": [
        "Ok, so I'm just with this little familiar lady that I don't know who she is in my life. She's probably like, I'm in mid-30s, late-30s, little older than me. I'm usually on my age when I'm younger. She is pretty outspoken, kind of harsh, but funny. She is a bit of a horned dog. Um... I'm... I'm with her for the intention of having sex. And she's telling me some stuff to do. And as she wants to eat and we do some jugs together. She makes like weird drinks. Like the last drink that we did was I don't even know what kind of alcohol it was. It was a new test tube that had like LEDs in there or something. Um... I feel like she just broke up with a friend or something. Like a friend of mine, I don't know."
    ],
    "2020-03-18": [
        "Alright, so it was working at the circus in Hawaii. I was new to it. And it was like more laid back. Like it was more just circus reformers running it. And it's a little bit more free for all. And so I don't really remember doing my act. I remember there was a black and white theme. It was like black and white stuff. And like after I did my act I think I stayed on stage and went over to the side. I started watching the act. And at first I was like watching it boardly. But then I remember that guy I should look like this is super interesting. I was still on stage just off the side. Someone else was doing the same thing with me still on stage. But then as that actually ended they just ended the show. And they never went to the Grand Finale. The act was like black and white. The Grand Finale was supposed to be green. But when it did I was really surprised because I was expecting at least a whole nother set with more impressive stuff. But then afterwards I talked to the girl who was on stage. And she explained that the people that were going to do it were... Who was in the Grand Finale or something. The stage crew had some other concert that they had to go to. And so they just ended early. And then I had a little conversation with that lady where we discussed how... I was back for circus and back for the show. I guess people just assumed that that's what it was. Who wouldn't even tell them that they were missing an actor or whatever. Thank you."
    ],
    "2020-03-16": [
        "Alright, so I was a... I was a basketball player and I was playing against like... I don't know, it was Kobe Bryant It was somebody on the Lakers I was brand new like a rookie, he was experienced and I was doing a good job at like... defending against him I never watched a full football game There was something like... they really needed me and so I... I just kinda joined I was wearing socks over top of big goofy socks"
    ]
}